{
  "last_updated": "2026-02-07 09:44",
  "items": [
    {
      "title": "Spot Prices Wrap: Eastern Freeze Sends Natural Gas Soaring into Weekend",
      "link": "https://naturalgasintel.com/news/spot-prices-wrap-eastern-freeze-sends-natural-gas-soaring-into-weekend/",
      "summary": "Physical pricing for the natural gas weekend package rallied at most locations on Friday as harsh cold gripped the Northeast and forecasts hinted at modest West Coast cooldown next week.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Oversupply Keeps California Natural Gas Prices Low as Storm Premium Rocks Northeast Markets",
      "link": "https://naturalgasintel.com/news/oversupply-keeps-california-natural-gas-prices-low-as-storm-premium-rocks-northeast-markets/",
      "summary": "While U.S. Northeast natural gas prices are on the move higher yet again amid unrelenting winter storms, West prices continue to languish at seasonal lows.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Futures Settle: Halfhearted Natural Gas Recovery Fizzles Into Weekend on Weak Forecasts",
      "link": "https://naturalgasintel.com/news/futures-settle-halfhearted-natural-gas-recovery-fizzles-into-weekend-on-weak-forecasts/",
      "summary": "Even as a bitter cold snap rivaling the peak days of Winter Storm Fern enveloped the Northeast, prompt month natural gas futures lost ground on Friday as two-week forecasts offered little bullish support.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Shell Says LNG Canada Exports Cut AECO Exposure as Phase 2 Talks Progress",
      "link": "https://naturalgasintel.com/news/shell-says-lng-canada-exports-cut-aeco-exposure-as-phase-2-talks-progress/",
      "summary": "Key LNG Canada partners are crediting the project’s export ramp-up for staunching impacts from falling oil and natural gas prices as talks of a potential expansion heat up.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Snapshot: Northeast Spot Natural Gas Prices Surge on Renewed Cold While West Texas Slides",
      "link": "https://naturalgasintel.com/news/midday-snapshot-northeast-spot-natural-gas-prices-surge-on-renewed-cold-while-west-texas-slides/",
      "summary": "Cash gas prices were mostly higher for the Saturday–Monday package traded Friday. Northeast prices surged as Mother Nature lined up another assault on the region, while milder conditions weighed predominantly in West Texas.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Canadian Natural Gas Producer Arc Resources Reports Rosier Demand Outlook",
      "link": "https://naturalgasintel.com/news/canadian-natural-gas-producer-arc-resources-reports-rosier-demand-outlook/",
      "summary": "Arc Resources Ltd., the third-largest natural gas producer in Canada, said it boosted total output to new highs during 2025 and intends to invest in further growth this year as global energy demand mounts.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Cheniere Moving Ahead With Yet Another LNG Expansion Project at Corpus Christi Terminal",
      "link": "https://naturalgasintel.com/news/cheniere-moving-ahead-with-yet-another-lng-expansion-project-at-corpus-christi-terminal/",
      "summary": "Cheniere Energy Inc. has filed an application to construct the Corpus Christi LNG (CCL) Stage 4 expansion project that would add another 24 million tons/year of liquefaction capacity at the export terminal in South Texas.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Futures: March Natural Gas Holds Upside as Cold Threatens Another Demand Surge",
      "link": "https://naturalgasintel.com/news/midday-futures-march-natural-gas-holds-upside-as-cold-threatens-another-demand-surge/",
      "summary": "Natural gas futures held onto gains through midday Friday as forecasts called for another round of cold that was expected to drive demand and push inventories still lower following a historic withdrawal reported Thursday.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Northeast Natural Gas Forward Prices Collapse After Winter Storm Fern",
      "link": "https://naturalgasintel.com/news/northeast-natural-gas-forward-prices-collapse-after-winter-storm-fern/",
      "summary": "Natural gas forward prices have eased as parts of the United States thaw out and market volatility has stabilized following an historic winter storm that battered much of the country late last month.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Enterprise Keeps ‘Running Shoes on’ as Execs See Permian Natural Gas Supply Growth Accelerating",
      "link": "https://naturalgasintel.com/news/enterprise-keeps-running-shoes-on-as-execs-see-permian-natural-gas-supply-growth-accelerating/",
      "summary": "Permian Basin natural gas supply growth shows no signs of slowing, Enterprise Products Partners LP executives said this week, with record processing volumes and firmer forward Waha basis prices underscoring momentum through 2027.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Japan’s Mitsui Nears Deal to Buy Stake in Huge Qatar LNG Project",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Japans-Mitsui-Nears-Deal-to-Buy-Stake-in-Huge-Qatar-LNG-Project.html",
      "summary": "Japan’s trading company Mitsui & Co is in an advanced stage of talks with QatarEnergy to buy a minority stake in one of Qatar’s mega expansion projects, anonymous sources with knowledge of the development told Reuters on Friday.   Qatar’s state firm ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Majors' Shareholder Payouts Are Under Pressure",
      "link": "https://oilprice.com/Energy/Energy-General/Oil-Majors-Shareholder-Payouts-Are-Under-Pressure.html",
      "summary": "Oil Majors' Shareholder Payouts Under Pressure Oil majors continue to publish their Q4 2025 results, with UK-based energy giant Shell joining the ranks of those that missed fourth-quarter expectations by reporting an 11% decline in profits (at $3.3 b",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Chevron Stays in the Hunt for Lukoil’s International Assets",
      "link": "https://oilprice.com/Energy/Energy-General/Chevron-Stays-in-the-Hunt-for-Lukoils-International-Assets.html",
      "summary": "A consortium comprising Chevron and a group led by an investment bank continues negotiations with Lukoil and U.S. officials to buy the Russian firm’s international assets, even as Lukoil has signed a preliminary non-exclusive deal with Carlyle, multi",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Prices Slide as Diplomacy Drains the Risk Premium",
      "link": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Slide-as-Diplomacy-Drains-the-Risk-Premium.html",
      "summary": "WTI crude oil futures are wrapping up a volatile week with the market trading at $62.99, down $2.22 or -3.40%. With one day left before the week ends, the primary driver of the choppy trade has been the reduction of the risk premium after reports on ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "China Steps In as India Wavers in Russia’s Oil Trade",
      "link": "https://oilprice.com/Energy/Crude-Oil/China-Steps-In-as-India-Wavers-in-Russias-Oil-Trade.html",
      "summary": "Russia’s oil exports came under renewed scrutiny in early February after U.S. President Donald Trump said Washington had agreed a trade deal with India that would cut tariffs on Indian goods from 50% to 18% in exchange, besides other concessions, to ",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}