{
  "last_updated": "2025-11-11 23:31",
  "items": [
    {
      "title": "Oil Rises as U.S. Sanctions Hit Russian Exports and Lukoil Declares Force Majeur",
      "link": "https://oilprice.com/Energy/Crude-Oil/Oil-Rises-as-US-Sanctions-Hit-Russian-Exports-and-Lukoil-Declares-Force-Majeur.html",
      "summary": "Oil prices gained on Tuesday as fresh U.S. sanctions on Russian oil disrupted exports. OPEC+ Plays the Waiting Game as Stock Builds Loom Large - This winter’s LNG markets are unlikely to replicate last year’s tightness as key Asian buyers have built ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Ukraine Launches Sweeping Energy Sector Corruption Probe Amid War",
      "link": "https://oilprice.com/Energy/Energy-General/Ukraine-Launches-Sweeping-Energy-Sector-Corruption-Probe-Amid-War.html",
      "summary": "Ukraine's anti-corruption watchdog has announced a \"large-scale operation\" exposing tens of millions of dollars of graft in the energy sector in the midst of Russia's full-scale invasion. The National Anti-Corruption Bureau of Ukraine (NABU) said the",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iran’s Deputy Foreign Minister Calls for New Nuclear Talks",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Irans-Deputy-Foreign-Minister-Calls-for-New-Nuclear-Talks.html",
      "summary": "Iran will not compromise its national security but is open to talks aimed at reaching a “peaceful” nuclear deal with the United States, Iranian deputy foreign minister, Saeed Khatibzadeh, said on Tuesday.  The U.S. and Iran held several rounds of neg",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "China's CO2 Emissions Have Been Flat for 18 Months Straight",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Chinas-CO2-Emissions-Have-Been-Flat-for-18-Months-Straight.html",
      "summary": "China has seen its carbon dioxide (CO2) emissions keep a flat or falling trend for 18 consecutive months as electric vehicles and renewable energy uptake soars, a new analysis for Carbon Brief showed on Tuesday.   CO2 emissions in China, the world’s ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Shell Takes Venture Global LNG Arbitration Loss to NY Supreme Court",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Shell-Takes-Venture-Global-LNG-Arbitration-Loss-to-NY-Supreme-Court.html",
      "summary": "Shell has challenged an arbitration ruling against it in the long-running dispute with Venture Global over contracted LNG supply, alleging the U.S. LNG exporter withheld information to Shell and the arbitration court. Shell has challenged the arbitra",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "India’s ONGC Net Profit Slips 18% as Oil Prices Drop",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Indias-ONGC-Net-Profit-Slips-18-as-Oil-Prices-Drop.html",
      "summary": "Indian state-owned Oil and Natural Gas Corporation Limited (ONGC), the biggest oil and gas explorer and producer in the country, booked a 17.8% decline in its net profit for the July-September quarter compared to a year earlier as lower oil prices de",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Nigeria Eyes 1.7 Billion Barrels in New Oil Supply",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Nigeria-Eyes-17-Billion-Barrels-in-New-Oil-Supply.html",
      "summary": "Nigeria could tap 1.7 billion barrels in new oil supply as well as 7.7 trillion cu ft of natural gas after the approval of 43 field development plans this year. The figures were reported by the chief executive of the Nigerian Upstream Petroleum Regul",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Sanctions and Ice Hinder Russia’s Arctic Oil Exports",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Sanctions-and-Ice-Hinder-Russias-Arctic-Oil-Exports.html",
      "summary": "Russian crude oil deliveries to Asia via the Northern Sea Route have failed to increase as expected during the 2025 season, falling by 4.2% from 2024 levels. According to figures reported by Kommersant daily, Russian oil exporters shipped 1.83 millio",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}