{
  "last_updated": "2026-01-03 10:38",
  "items": [
    {
      "title": "Maduro Says He Welcomes U.S. Investments in Venezuela’s Oil",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Maduro-Says-He-Welcomes-US-Investments-in-Venezuelas-Oil.html",
      "summary": "Venezuela is ready to accept U.S. investment in its oil, Nicolas Maduro said late on Thursday, in a stark softening of the rhetoric from the embattled Venezuelan leader.   Maduro suggested serious talks between Venezuela and the United States in an i",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "OPEC+ Set to Keep Oil Production Policy Despite Saudi-UAE Spat",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/OPEC-Set-to-Keep-Oil-Production-Policy-Despite-Saudi-UAE-Spat.html",
      "summary": "Despite the public spat between two of OPEC’s top producers, Saudi Arabia and the United Arab Emirates (UAE), the wider OPEC+ group is expected to confirm at a Sunday meeting that it would hold output steady through the first quarter of 2026, delegat",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Awaits a Catalyst as Brent Treads Water",
      "link": "https://oilprice.com/Energy/Energy-General/Oil-Awaits-a-Catalyst-as-Brent-Treads-Water.html",
      "summary": "Another setback in Russia–Ukraine peace talks and persistent tensions around Venezuela failed to jolt oil markets out of their New Year’s lull. 02 January, 2026 Another round of failed Russia-Ukraine peace talks and continued tensions around Venezuel",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "India to Leverage Russian Oil Import Data in Trade Deal Negotiations",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/India-to-Leverage-Russian-Oil-Import-Data-in-Trade-Deal-Negotiations.html",
      "summary": "India’s government is asking domestic refiners to provide timely and accurate data on a weekly basis of imports of Russian and U.S. crude, as New Delhi plans to show the data to the U.S. Administration as it seeks a trade deal, sources with knowledge",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The Limits of Saudi Power in Southern Yemen",
      "link": "https://oilprice.com/Energy/Energy-General/The-Limits-of-Saudi-Power-in-Southern-Yemen.html",
      "summary": "Earlier this week, Aden airport (in Yemen’s interim capital) was shut after a dispute between the Saudi-backed Yemeni government and UAE-aligned STC forces over control of airport operations and security. Government officials attempted to assert auth",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Top Chinese Offshore Gas Field Ships 100th Oil Cargo",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Top-Chinese-Offshore-Gas-Field-Ships-100th-Oil-Cargo.html",
      "summary": "China’s largest and deepest offshore gas field has shipped its 100th cargo of condensate, China National Offshore Oil Corporation (CNOOC), China’s top offshore crude oil and natural gas producer, said on Friday.  Production of the first phase of the ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Nigeria’s NNPC Boosts Oil Production to 1.6 Million Bpd",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Nigerias-NNPC-Boosts-Oil-Production-to-16-Million-Bpd.html",
      "summary": "Nigeria’s state-owned oil and gas company NNPC this week reported crude oil and condensate production of 1.6 million barrels per day (bpd) for November 2025, up by 1.3% from October levels.  Natural gas output fell slightly to 6.97 million standard c",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "U.S. LNG Exports Break 100 Million Tons in Record 2025",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/US-LNG-Exports-Break-100-Million-Tons-in-Record-2025.html",
      "summary": "U.S. liquefied natural gas exports set new records in 2025 as new capacity came online and existing terminals ran at high utilization, pushing annual shipments past levels previously thought years away. Preliminary data from LSEG show the United Stat",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}