{
  "last_updated": "2025-12-13 09:44",
  "items": [
    {
      "title": "Fleeting Cold Weather Punch Leaves Natural Gas Futures on the Ropes",
      "link": "https://naturalgasintel.com/news/fleeting-cold-weather-punch-leaves-natural-gas-futures-on-the-ropes/",
      "summary": "There were further losses in natural gas futures on Friday as market participants appeared to be giving up on winter before what is considered its official start with the solstice on Dec. 21.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Natural Gas Futures Ending Rough Week on Sour Note",
      "link": "https://naturalgasintel.com/news/natural-gas-futures-ending-rough-week-on-sour-note/",
      "summary": "Prompt-month natural gas futures were on track for substantial weekly losses as forecasts pointed to a much warmer-than-normal second half of December.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "OFOs Spread as Arctic Air Tests Natural Gas Pipeline Flexibility",
      "link": "https://naturalgasintel.com/news/ofos-spread-as-arctic-air-tests-natural-gas-pipeline-flexibility/",
      "summary": "Natural gas pipelines issued a wave of operational flow orders (OFO) and cold weather notices across northern and eastern states heading into the weekend, with shippers facing stricter balancing tolerances as Arctic air pushes deeper into the Lower 4",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Natural Gas Forwards Crushed by Warmer Weather Forecasts",
      "link": "https://naturalgasintel.com/news/natural-gas-forwards-crushed-by-warmer-weather-forecasts/",
      "summary": "Natural gas forward prices retreated sharply during the Dec. 3–10 trading period as a rapid reversal in winter weather forecasts pushed late December temperatures back toward normal following the month’s chilly start.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "KMI Boosts Expansion Capex as Southern U.S., Mexico Fuel Natural Gas Demand",
      "link": "https://naturalgasintel.com/news/kmi-boosts-expansion-capex-as-southern-us-mexico-fuel-natural-gas-demand/",
      "summary": "Kinder Morgan Inc. (KMI) CEO Kim Dang said the Houston-based midstream behemoth is now expecting growth capital expenditures (capex) to exceed $3 billion annually over the next few years, about $500 million higher than previous guidance.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "BP, Chevron Lead Bidders in First U.S. Offshore Natural Gas, Oil Auction in Two Years",
      "link": "https://naturalgasintel.com/news/bp-chevron-lead-bidders-in-first-us-offshore-natural-gas-oil-auction-in-two-years/",
      "summary": "The first federal lease sale in two years to capture tracts offshore the Gulf Coast drew the highest bids from some of the biggest U.S. oil and gas producers, marking a “clear vote of confidence” for U.S. energy development, a Trump administration of",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "East Region Natural Gas Storage Drops Into Deficit Territory as Winter Demand Steps up",
      "link": "https://naturalgasintel.com/news/east-region-natural-gas-storage-drops-into-deficit-territory-as-winter-demand-steps-up/",
      "summary": "Natural gas in storage in the East region is notably below historic norms as winter weather settles across much of the Lower 48. Midwest stocks are also relatively lean.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Is it Over Yet? Natural Gas Futures Limping into Weekend After Weather-Driven Rout",
      "link": "https://naturalgasintel.com/news/is-it-over-yet-natural-gas-futures-limping-into-weekend-after-weather-driven-rout/",
      "summary": "A relief rally to end a dismal week for natural gas futures had not yet materialized Friday morning as the prompt month edged modestly lower.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Sanctions Cloud Future of Turkey's Gas Deals with Iran and Turkmenistan",
      "link": "https://oilprice.com/Energy/Natural-Gas/Sanctions-Cloud-Future-of-Turkeys-Gas-Deals-with-Iran-and-Turkmenistan.html",
      "summary": "Turkish President Recep Tayyip Erdogan is traveling to Turkmenistan for festivities December 12 marking the Central Asian state’s 30th anniversary of neutrality. While in Ashgabat, Erdogan will also hold talks with Turkmen leaders likely focusing on ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "South Sudan Deploys Troops to Secure Heglig Oil Field",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/South-Sudan-Deploys-Troops-to-Secure-Heglig-Oil-Field.html",
      "summary": "South Sudan has moved troops into Sudan’s Heglig oil field under what it calls a tripartite agreement with Sudan’s two warring factions. The move is a rare arrangement aimed at shielding critical oil infrastructure as fighting escalates across West K",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Nigeria Taps Flared Gas to Cut Emissions and Boost Power Supply",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Nigeria-Taps-Flared-Gas-to-Cut-Emissions-and-Boost-Power-Supply.html",
      "summary": "Nigeria has approved 28 companies to buy natural gas that is currently being flared at oil fields, a long-running problem the country has talked about fixing for years and is now trying—again—to turn into something usable. The permits were issued und",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "US Drillers Add Oil Rigs As Analysts Warn of Incoming Glut",
      "link": "https://oilprice.com/Energy/Crude-Oil/US-Drillers-Add-Oil-Rigs-As-Analysts-Warn-of-Incoming-Glut.html",
      "summary": "The total number of active drilling rigs for oil and gas in the United States fell by 1 this week, according to new data that Baker Hughes published on Friday, bringing the total rig count in the US  to 548 this week, according to Baker Hughes, down ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Hungary Signs Gas Supply Deal with Azerbaijan",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Hungary-Signs-Gas-Supply-Deal-with-Azerbaijan.html",
      "summary": "Hungary has secured an agreement to receive natural gas from Azerbaijan for the next two years, Hungarian Foreign Minister Peter Szijjarto said, as the central EU member state disputes the bloc’s pledge to phase out Russian gas imports.   “We have se",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "India Greenlights First-Ever Coal Exports Policy",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/India-Greenlights-First-Ever-Coal-Exports-Policy.html",
      "summary": "India’s government approved on Friday auctions for coal that buyers could use for industrial activity and exports in yet another reform in the vast coal sector.   The government endorsed the new policy for auction of Coal Linkage for Seamless, Effici",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Sinks Despite Rate Cuts and Tanker Seizures",
      "link": "https://oilprice.com/Energy/Crude-Oil/Oil-Sinks-Despite-Rate-Cuts-and-Tanker-Seizures.html",
      "summary": "Oil sentiment has turned sour despite a Fed rate cut and the Trump administration’s aggressive tanker seizures. Friday, December 12, 2025 The US Federal Reserve has lowered the federal funds rate to 3.50-3.75%, the Trump administration has seized a V",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}