{
  "last_updated": "2025-11-16 13:14",
  "items": [
    {
      "title": "Floating Oil Storage Surge Puts Market Balance on Edge",
      "link": "https://oilprice.com/Energy/Crude-Oil/Floating-Oil-Storage-Surge-Puts-Market-Balance-on-Edge.html",
      "summary": "A shadow fleet is quietly swelling across the world’s oceans, packed with sanctioned barrels from Russia, Iran, and Venezuela. For now, those tankers have kept to the sidelines of the global market—but the sheer scale of crude idling offshore could s",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The AI Boom Is Driving a Massive Geothermal Energy Revival",
      "link": "https://oilprice.com/Alternative-Energy/Geothermal-Energy/The-AI-Boom-Is-Driving-a-Massive-Geothermal-Energy-Revival.html",
      "summary": "Geothermal energy is becoming Big Tech’s newest darling. Silicon Valley is upending its deep pockets into enhanced geothermal startups in a bid to stay one step ahead of the massive energy demand growth trend being spurred by the AI boom. Geothermal ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Trump Bets Big on a Nuclear Comeback",
      "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Trump-Bets-Big-on-a-Nuclear-Comeback.html",
      "summary": "United States President Donald Trump is putting his money where his mouth is as he doubles down on efforts to accelerate the expansion of the country’s nuclear energy sector. The government will spend billions in public funding to reinvigorate U.S. n",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iran Is on the Brink of “Water Bankruptcy”",
      "link": "https://oilprice.com/Energy/Energy-General/Iran-Is-on-the-Brink-of-Water-Bankruptcy.html",
      "summary": "Decades of mismanagement compounded by prolonged drought have pushed Iran to the brink of what experts call water bankruptcy. With reservoirs running on empty and rainfall at a record low, the authorities have begun rationing water supplies in the Ir",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The UK Is Transforming Coal Mines Into Geothermal Hubs",
      "link": "https://oilprice.com/Energy/Energy-General/The-UK-Is-Transforming-Coal-Mines-Into-Geothermal-Hubs.html",
      "summary": "Coal mines are finding a second life as companies invest in repurposing huge, disused coal sites into geothermal power projects. In the U.K., the government and energy companies have been discussing the idea for several years, and it seems to be gain",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}