{
  "last_updated": "2026-01-18 09:23",
  "items": [
    {
      "title": "Oil’s Problem Isn’t Iran or Russia — It’s Too Much Oil",
      "link": "https://oilprice.com/Energy/Crude-Oil/Oils-Problem-Isnt-Iran-or-Russia-Its-Too-Much-Oil.html",
      "summary": "Crude oil prices are in retreat after rising on the possibility of U.S. strikes on Iran. Before the retreat, however, Brent crude and WTI had jumped to the highest in months, countering bearish forecasts for the year—and tearing traders between geopo",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Cuba’s Energy Crisis Will Worsen Without Venezuelan Oil",
      "link": "https://oilprice.com/Energy/Energy-General/Cubas-Energy-Crisis-Will-Worsen-Without-Venezuelan-Oil.html",
      "summary": "Cuba has been experiencing a worsening energy crisis for several years, which has led it to rely heavily on Venezuela for its fuel. Following the United States' intervention in Venezuela earlier this month, Cuba is expected to lose a vital supply cha",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Inside Brazil’s Race to Secure Gas Supply",
      "link": "https://oilprice.com/Energy/Energy-General/Inside-Brazils-Race-to-Secure-Gas-Supply.html",
      "summary": "TAG is the gas transmission operator responsible for the main transport corridor connecting Cabiunas, Brazil (Point I), the biggest gas injection point in the country, located from Rio de Janeiro to Ceara (Point O). TAG will play a central role in in",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Trump Keeps Oil Traders Guessing on Iran",
      "link": "https://oilprice.com/Energy/Energy-General/Trump-Keeps-Oil-Traders-Guessing-on-Iran.html",
      "summary": "Oil markets are trapped in a Trump-driven guessing game, with Iran fears lifting prices one moment and calming signals pulling them back the next. Friday, January 16, 2026 Will Donald Trump attack Iran again or not? That has been the multi-billion-do",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}