{
  "last_updated": "2026-02-08 13:38",
  "items": [
    {
      "title": "Vague Oman Talks Set Oil Up for Whiplash",
      "link": "https://oilprice.com/Energy/Energy-General/Vague-Oman-Talks-Set-Oil-Up-for-Whiplash.html",
      "summary": "U.S.–Iran nuclear talks in Oman cooled oil markets, pushing Brent back to $67 and setting up volatility as vague outcomes leave sentiment hostage to headlines. Friday, February 06, 2026 The start of US-Iran nuclear talks in Oman has had a placating e",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Why Cutting Russia Out of India’s Oil Mix Won’t Be Easy",
      "link": "https://oilprice.com/Energy/Energy-General/Why-Cutting-Russia-Out-of-Indias-Oil-Mix-Wont-Be-Easy.html",
      "summary": "India imports 85% of the oil it consumes. A third of that comes from Russia—or used to come from Russia, until last November, when President Trump’s administration sanctioned the top exporters. Now, Washington is doubling down on cutting India’s oil ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iowa’s Wind Boom Stalls as Politics Clashes With Power Prices",
      "link": "https://oilprice.com/Energy/Energy-General/Iowas-Wind-Boom-Stalls-as-Politics-Clashes-With-Power-Prices.html",
      "summary": "On January 20, the United States Department of Energy released a report on the first year of Donald Trump's second term called “PROMISES MADE, PROMISES KEPT” which touted a return to global energy dominance and a reversal of the “Biden energy subtrac",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "EU Escalates Oil Sanctions With Broad Ban on Shipping Services",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/EU-Escalates-Oil-Sanctions-With-Broad-Ban-on-Shipping-Services.html",
      "summary": "The European Union is preparing to take a much bigger swing at Russia’s oil trade, and this time Brussels is aiming less at optics and more at the plumbing that actually keeps barrels moving. The European Commission has proposed what would be its bro",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Washington Targets Tankers Keeping Iranian Crude Moving",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Washington-Targets-Tankers-Keeping-Iranian-Crude-Moving.html",
      "summary": "Washington moved to tighten the screws on Iran’s oil trade again on Friday, rolling out a fresh batch of sanctions aimed squarely at the shadow fleet that keeps Tehran’s barrels moving when they’re not supposed to be. The State Department announced s",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Big Oil’s Merger Boom Is Being Driven by a Surprisingly Small Club",
      "link": "https://oilprice.com/Energy/Energy-General/Big-Oils-Merger-Boom-Is-Being-Driven-by-a-Surprisingly-Small-Club.html",
      "summary": "The oil and gas sector is continuing to consolidate after years of ‘merger-mania’, with ramifications for the entire energy sector and wider economy. But a recent report reveals that the spate of mergers and acquisitions that has characterized the fo",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Venezuela’s Return Won’t Dethrone Latin America’s Oil Leaders",
      "link": "https://oilprice.com/Energy/Energy-General/Venezuelas-Return-Wont-Dethrone-Latin-Americas-Oil-Leaders.html",
      "summary": "Argentina, Guyana, and Brazil are poised to lead Latin American oil production growth in 2026, even though the possible return of Venezuelan barrels poses questions for the region’s long-term capital expenditure strategy. While the supermajors contin",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "US Oil Drillers Add Rigs Even in Price Uncertainty",
      "link": "https://oilprice.com/Energy/Energy-General/US-Oil-Drillers-Add-Rigs-Even-in-Price-Uncertainty.html",
      "summary": "The total number of active drilling rigs for oil and gas in the United States rose by 5 this week, according to new data that Baker Hughes published on Friday, bringing the total rig count in the US  to 551 this week, down 35 from this same time last",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "TotalEnergies Pushes Deeper Into Namibia’s Offshore Oil Boom",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/TotalEnergies-Pushes-Deeper-Into-Namibias-Offshore-Oil-Boom.html",
      "summary": "TotalEnergies is expanding its exploration portfolio offshore Namibia with acreage north of a block where a major oil discovery has been made, as the supermajor looks to boost activity in the new global exploration hotspot. TotalEnergies on Friday an",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}