{
  "last_updated": "2025-11-18 14:44",
  "items": [
    {
      "title": "Nuclear Stocks Crash, With A Potential Payoff Still Years Away",
      "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Nuclear-Stocks-Crash-With-A-Potential-Payoff-Still-Years-Away.html",
      "summary": "Over the past couple of years, uranium and nuclear energy markets have enjoyed a renaissance thanks to surging global power demand and the global energy crisis triggered by Russia’s war in Ukraine. Uranium is no longer trading on legacy sentiment, wi",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "LNG Exports Will Drive Explosion in U.S. Natural Gas Consumption",
      "link": "https://oilprice.com/Energy/Natural-Gas/LNG-Exports-Will-Drive-Explosion-in-US-Natural-Gas-Consumption.html",
      "summary": "The expected surge in liquefied natural gas export capacity in the United States is on course to boost gas consumption significantly, from around 18 billion cu ft right now to as much as 40 billion cu ft—and that 18 billion cu ft is already an all-ti",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iran’s Hidden Nuclear Push Resumes Under Pickaxe Mountain",
      "link": "https://oilprice.com/Geopolitics/Middle-East/Irans-Hidden-Nuclear-Push-Resumes-Under-Pickaxe-Mountain.html",
      "summary": "Iran is blocking the International Atomic Energy Agency (IAEA) from inspecting multiple sites of interest in its nuclear weapons development programme, a senior source in the European Union’s (E.U.’s) security complex exclusively told OilPrice.com la",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "From Oil Giant to Mining Superpower—Saudi Arabia’s Next Big Move",
      "link": "https://oilprice.com/Energy/Energy-General/From-Oil-Giant-to-Mining-SuperpowerSaudi-Arabias-Next-Big-Move.html",
      "summary": "In the coming days, the media will push themes related to the upcoming meeting between Saudi Crown Prince Mohammed bin Salman (MBS) and US President Trump in Washington. While most will be looking at the possibilities of Saudi investments in US LNG v",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Egypt Secures Another Western Desert Gas Find",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Egypt-Secures-Another-Western-Desert-Gas-Find.html",
      "summary": "A new gas discovery in Egypt’s Western Desert has added another timely boost to the country’s strained upstream portfolio. The well, identified as Gomana-1, encountered several gas-bearing intervals based on electric-log data, with early tests indica",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "UK Court Finds BHP Liable for Brazil’s Worst Environmental Disaster",
      "link": "https://oilprice.com/The-Environment/Oil-Spills/UK-Court-Finds-BHP-Liable-for-Brazils-Worst-Environmental-Disaster.html",
      "summary": "Mining giant BHP has been found liable for a dam disaster under both environmental law and the Brazilian civil code, in a significant ruling handed down by the High Court. The case stems from a deadly dam disaster in Brazil. On 5 November 2015, the F",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Decoding the Fine Print: An Investor’s Guide to Energy Contracts",
      "link": "https://oilprice.com/Energy/Energy-General/Decoding-the-Fine-Print-An-Investors-Guide-to-Energy-Contracts.html",
      "summary": "We spend a lot of our time talking about reserves and capacity in the energy sector. But for the serious money, the most critical asset isn't the price of oil or the megawatt. It’s the paper that guarantees how those resources will be sold. A company",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iran's Water Crisis Is a Worrying Sign of Things to Come",
      "link": "https://oilprice.com/Energy/Energy-General/Irans-Water-Crisis-Is-a-Worrying-Sign-of-Things-to-Come.html",
      "summary": "I've put the word \"evacuation\" in the title of this piece in quotes because it's not clear where Tehran's 9.8 million people, or some significant number of them, would evacuate to as water supplies run dangerously low. Iranian President Massoud Pezes",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Lithium Prices Surge as China Signals Sharper Demand Rebound",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Lithium-Prices-Surge-as-China-Signals-Sharper-Demand-Rebound.html",
      "summary": "Global lithium prices surged on Monday after a demand upgrade from China led traders to revisit near-term supply assumptions across the battery-materials market. The move followed an update highlighted by the Financial Post, which reported renewed bu",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iran Minister Claims Nuclear Enrichment Halted After U.S.-Israeli Attack",
      "link": "https://oilprice.com/Energy/Energy-General/Iran-Minister-Claims-Nuclear-Enrichment-Halted-After-US-Israeli-Attack.html",
      "summary": "Iran, having seen its key nuclear facilities blown up by the Israeli and US surprise attacks of last June, and having long been under Washington and Western-led sanctions, could now be signaling a major olive branch. It is telling the West that there",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}