{
  "last_updated": "2026-01-17 11:17",
  "items": [
    {
      "title": "Spot Prices Wrap: Physical Natural Gas Market Braces for Bone-Chilling Freeze",
      "link": "https://naturalgasintel.com/news/spot-prices-wrap-physical-natural-gas-market-braces-for-bone-chilling-freeze/",
      "summary": "Cash prices for natural gas delivered through the holiday weekend and next Tuesday — Martin Luther King Jr. Day is Monday — rallied to close out the trading week, bolstered by bullish momentum in the Northeast.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Futures Settle: Once Again, February Natural Gas Fizzles",
      "link": "https://naturalgasintel.com/news/futures-settle-once-again-february-natural-gas-fizzles/",
      "summary": "Natural gas futures failed to find footing on Friday despite frigid weather forecasts and the potential for heftier storage withdrawals in the second half of winter.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Magnolia LNG Pushes Back Louisiana Project Timeline, Citing Biden-Era DOE Policy",
      "link": "https://naturalgasintel.com/news/magnolia-lng-pushes-back-louisiana-project-timeline-citing-biden-era-doe-policy/",
      "summary": "A unit of Glenfarne Group LLC, the company behind the Alaska LNG and Texas LNG projects, is seeking an extension for a long-proposed southwest Louisiana export terminal.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Court Upholds Texas LNG Deadline Extension, Clearing Path for FID",
      "link": "https://naturalgasintel.com/news/court-upholds-texas-lng-deadline-extension-clearing-path-for-fid/",
      "summary": "A federal court has rejected an environmentalist group’s legal challenge against Texas LNG’s construction extension, averting another possible disruption in the project’s long timeline.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Snapshot: Natural Gas Cash Prices Surge as Production Freeze-Offs Said Possible",
      "link": "https://naturalgasintel.com/news/midday-snapshot-natural-gas-cash-prices-surge-as-production-freeze-offs-said-possible/",
      "summary": "With temperatures dropping ahead of the extended Martin Luther King Jr. holiday weekend, natural gas spot prices mounted gains across the country.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "U.S. LNG Feed Gas Deliveries Bounce Back as Unplanned Outages End, TTF Rallies",
      "link": "https://naturalgasintel.com/news/us-lng-feed-gas-deliveries-bounce-back-as-unplanned-outages-end-ttf-rallies/",
      "summary": "Feed gas deliveries to U.S. LNG export facilities appeared to bounce back on Friday after a midweek lull caused by unexpected maintenance at two facilities on the Gulf Coast.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Chicago Natural Gas Prices Drifting Lower Despite Single-Digit Temperature Forecast",
      "link": "https://naturalgasintel.com/news/chicago-natural-gas-prices-drifting-lower-despite-single-digit-temperature-forecast/",
      "summary": "NGI’s Chicago Citygate natural gas prices have softened in recent days, and while a cold snap is looming, it may not be enough to offer momentum to the market.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Futures: Natural Gas on Track for Weekly Decline After Storage Data Disappoints",
      "link": "https://naturalgasintel.com/news/midday-futures-natural-gas-on-track-for-weekly-decline-after-storage-data-disappoints/",
      "summary": "February natural gas futures appeared headed for modest week/week losses on Friday as ample supply outweighed supportive forecast trends.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Midmorning Markets: Regional Storage Split Widens as South Central Holds Natural Gas",
      "link": "https://naturalgasintel.com/news/midmorning-markets-regional-storage-split-widens-as-south-central-holds-natural-gas/",
      "summary": "While frigid weather drove deeper storage withdrawals in the East and Midwest, South Central inventories remained unchanged, highlighting persistent regional imbalances driven by mild weather and shifting gas flows.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Mitsubishi Enters U.S. Shale Natural Gas Business in $7.5B Haynesville Acquisition",
      "link": "https://naturalgasintel.com/news/mitsubishi-enters-us-shale-natural-gas-business-in-75b-haynesville-acquisition/",
      "summary": "Mitsubishi Corp. said Friday it would acquire the bulk of Aethon Energy Management LLC’s U.S. natural gas assets, which are located in the Haynesville Shale, in a deal valued at more than $7.5 billion.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Inside Brazil’s Plan to Integrate Pre-Salt Gas and Diversify Supply",
      "link": "https://oilprice.com/Energy/Energy-General/Inside-Brazils-Plan-to-Integrate-Pre-Salt-Gas-and-Diversify-Supply.html",
      "summary": "In the second installment of a three-part series focused on South American pipeline infrastructure, we head to Brazil. The country faces the challenge of reinforcing its pipeline network to absorb growing pre-salt gas while managing declining imports",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Majors Tell Washington They Want PDVSA Out of the Way",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Majors-Tell-Washington-They-Want-PDVSA-Out-of-the-Way.html",
      "summary": "International oil companies are wasting no time testing how serious Washington and Caracas really are about reviving Venezuela’s oil industry. And their opening demand is refreshingly blunt: if we’re going to invest, we need to control our barrels. A",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "US Oil Drillers Add To Active Rigs",
      "link": "https://oilprice.com/Energy/Crude-Oil/US-Oil-Drillers-Add-To-Active-Rigs.html",
      "summary": "The total number of active drilling rigs for oil and gas in the United States fell by 1 this week, according to new data that Baker Hughes published on Friday, bringing the total rig count in the US  to 543 this week, down 37 from this same time last",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Utilities Scramble for Gas-Fired Capacity",
      "link": "https://oilprice.com/Energy/Natural-Gas/Utilities-Scramble-for-Gas-Fired-Capacity.html",
      "summary": "Talen Energy is following in the footsteps of utility peers Vistra and Constellation by spending billions of dollars acquiring gas generation assets to expand their capacity and grow market share in the growing power demand market. After spending abo",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "China Halts Electricity Imports from Russia Due to Price Dispute",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/China-Halts-Electricity-Imports-from-Russia-Due-to-Price-Dispute.html",
      "summary": "Russia is in negotiations with Beijing to potentially resume power supply to China, the Russian Energy Ministry told Reuters on Friday, after a Russian media report said that China halted electricity imports from Russia due to high prices.  On Friday",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}