{
  "last_updated": "2025-11-12 11:35",
  "items": [
    {
      "title": "Alaska’s Mega-Pipeline Gets a Second Chance in the Trump Energy Era",
      "link": "https://oilprice.com/Energy/Energy-General/Alaskas-Mega-Pipeline-Gets-a-Second-Chance-in-the-Trump-Energy-Era.html",
      "summary": "Baker Hughes (NYSE:BKR) has taken a decisive role in reviving one of America’s most ambitious energy projects. The Houston-based oilfield services firm has signed definitive agreements with Glenfarne Alaska LNG LLC, a subsidiary of Glenfarne Energy T",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "How America’s Shale Strategy Is Powering a New Middle East Energy Boom",
      "link": "https://oilprice.com/Energy/Energy-General/How-Americas-Shale-Strategy-Is-Powering-a-New-Middle-East-Energy-Boom.html",
      "summary": "The highly focused development of the U.S.’s shale oil and gas sectors from the early 2010s transformed it from one of the world’s biggest importers of both into one of its leading exporters of both. But it did much more than this: it reversed the ba",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Investors Flock Back to Natural Gas as Demand Soars",
      "link": "https://oilprice.com/Energy/Natural-Gas/Investors-Flock-Back-to-Natural-Gas-as-Demand-Soars.html",
      "summary": "From indispensable bridge fuel to dirtier than coal, natural gas has gone through a few turbulent years recently, culminating in the EU’s risky legislation that could see it left out in the cold and dark, and investors’ newfound—or newly remembered—a",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Trump Adds Coal To Critical Minerals List",
      "link": "https://oilprice.com/Energy/Coal/Trump-Adds-Coal-To-Critical-Minerals-List.html",
      "summary": "The pariah of fossil fuels has been given pride of place in the Trump administration’s ambitions for a more secure supply of critical minerals. Last week, the Interior Department added 10 minerals to a list it deems essential for the US economy and n",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Putin and Tokayev to Discuss Gas Cooperation, U.S. Sanctions Fallout",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Putin-and-Tokayev-to-Discuss-Gas-Cooperation-US-Sanctions-Fallout.html",
      "summary": "Russian President Vladimir Putin and Kazakh President Kassym-Jomart Tokayev are meeting in Moscow this week to discuss gas cooperation and the impact of U.S. sanctions on Russian oil majors with operations in Kazakhstan. The talks come as the Kremlin",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Mergers Are Back — But Wall Street’s Not Buying the Hype",
      "link": "https://oilprice.com/Energy/Energy-General/Mergers-Are-Back-But-Wall-Streets-Not-Buying-the-Hype.html",
      "summary": "Mergers are back in fashion, especially now that the government no longer objects as much as before. Why do a merger?  Well, the merging parties always say that the merger will strengthen competition (good for the public), lower operating costs (good",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Why America Is Winning the Carbon Capture Race",
      "link": "https://oilprice.com/Energy/Energy-General/Why-America-Is-Winning-the-Carbon-Capture-Race.html",
      "summary": "Carbon Capture and Storage (CCS) is no longer a futuristic idea or a climate scientist’s dream, it has become an unavoidable necessity for the sectors that cannot decarbonize through renewables or electrification alone. Cement, steel, refining, chemi",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Nigeria Launches 2025 Oil Licensing Round as Regulator Takes the Reins",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Nigeria-Launches-2025-Oil-Licensing-Round-as-Regulator-Takes-the-Reins.html",
      "summary": "Nigeria will open its 2025 oil licensing round on December 1, as the Upstream Petroleum Regulatory Commission (NUPRC) steps deeper into the role once dominated by the state oil company. The move signals President Bola Tinubu’s intent to boost output,",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The $2.9 Trillion Question: Who Will Power the AI Revolution?",
      "link": "https://oilprice.com/Energy/Energy-General/The-29-Trillion-Question-Who-Will-Power-the-AI-Revolution.html",
      "summary": "While the market is finally starting to grapple with the most unpleasant question of who will plug the funding gap needed to build out all the data centers required to make the AI dream a reality, a gap which Morgan Stanley recently calculated would ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Kenya’s Gulf Energy Sets 2026 Target for First Oil",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Kenyas-Gulf-Energy-Sets-2026-Target-for-First-Oil.html",
      "summary": "Kenya’s long-stalled Turkana oil dream has a new driver. Gulf Energy Ltd., a Nairobi-based trader, plans to start producing crude from the South Lokichar Basin by the end of 2026—nearly fifteen years after Tullow Oil’s original discovery. Tullow sold",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}