{
  "last_updated": "2025-11-20 10:01",
  "items": [
    {
      "title": "Refining Margins Soar as Global Oil Product Markets Tighten",
      "link": "https://oilprice.com/Energy/Energy-General/Refining-Margins-Soar-as-Global-Oil-Product-Markets-Tighten.html",
      "summary": "Refining margins in the U.S, northwest Europe, and Asia have jumped to two-year highs as diesel and gasoline markets tighten with no sign of immediate relief.   Refinery closures in recent years, planned maintenance after the summer, unplanned repair",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "U.S. Gasoline Inventories Sink To 12-Year Lows",
      "link": "https://oilprice.com/Energy/Crude-Oil/US-Gasoline-Inventories-Sink-To-12-Year-Lows.html",
      "summary": "Previously, we reported that the pivot by Indian refiners away from Russian oil has triggered a spike in oil product prices even as crude prices remain largely unchanged. To wit, ICE Brent-Gasoil crack spreads doubled from the $15-17/bbl range held i",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Germany Goes On LNG Import Terminal Building Spree",
      "link": "https://oilprice.com/Energy/Natural-Gas/Germany-Goes-On-LNG-Import-Terminal-Building-Spree.html",
      "summary": "Three years ago, Germany led an EU-wide offensive against Russian pipeline gas imports. These imports were no longer wanted in Europe because of the war in Ukraine. They would be replaced with LNG—for a short while—because the EU, and Germany, were f",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Beyond Black Mass: Scientists Find a Greener Way to Recycle EV Batteries",
      "link": "https://oilprice.com/Energy/Energy-General/Beyond-Black-Mass-Scientists-Find-a-Greener-Way-to-Recycle-EV-Batteries.html",
      "summary": "E-waste is a massive and rapidly growing issue as more and more of our electronic devices reach the end of their life and end up in landfills. Today, e-waste is the fastest growing solid waste stream on the planet.  Finding new ways to breathe life i",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Saudi Rare Earth Venture Sends MP Materials Shares Higher",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Saudi-Rare-Earth-Venture-Sends-MP-Materials-Shares-Higher.html",
      "summary": "MP Materials shares surged on Wednesday after the company announced a joint venture with Saudi Arabia’s Ma’aden to build a rare-earths processing and magnet manufacturing hub in the kingdom, a move that positions the U.S. producer inside one of the w",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "New Iraqi Leadership Confronts Water Shortage and Economic Strain",
      "link": "https://oilprice.com/Geopolitics/Middle-East/New-Iraqi-Leadership-Confronts-Water-Shortage-and-Economic-Strain.html",
      "summary": "Iraqis voted in a parliamentary election on 11 November and, though pre-election surveys predicted a record-low turnout, the final total turnout was 56.11% according to the Independent High Electoral Commission.  (Turnout for the 2021 parliamentary e",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The AI Power Surge Could End Badly",
      "link": "https://oilprice.com/Energy/Energy-General/The-AI-Power-Surge-Could-End-Badly.html",
      "summary": "Is AI in a bubble? When will the bubble burst? Are there signs? Well, we don’t have a crystal ball, but there are signs. On the markets, several prominent investors have spoken. Peter Thiel, one of the best-known tech investors, has sold his entire p",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Three Mile Island Reactor Gets a $1 Billion Government Lifeline",
      "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Three-Mile-Island-Reactor-Gets-a-1-Billion-Government-Lifeline.html",
      "summary": "One week ago we said that \"hundreds of billions\" of dollars are about to be loaned out to nuclear projects by the US government. Well, the first billion is about to be wired.  The Wall Street Journal reports Constellation Energy has secured a $1 bill",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "A Trend Break? EIA Sees Jump in Alaska Oil Production in 2026",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/A-Trend-Break-EIA-Sees-Jump-in-Alaska-Oil-Production-in-2026.html",
      "summary": "Alaska’s production outlook is shifting for the first time in nearly a decade, with the U.S. Energy Information Administration (EIA) on Wednesday projecting that North Slope crude output will rise by some 13% next year as two large fields move into h",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Emerging Economies Are Powering a Renewable Energy Revolution",
      "link": "https://oilprice.com/Energy/Energy-General/Emerging-Economies-Are-Powering-a-Renewable-Energy-Revolution.html",
      "summary": "Renewable energies are exploding in emerging economies as the economics of wind and solar make it the obvious choice in most national and regional contexts. What’s more, the rapidly changing economics of renewables are not just saving money for devel",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}