{
  "last_updated": "2025-11-17 16:28",
  "items": [
    {
      "title": "OPEC+ Poised to Keep Pumping Despite Rising Oversupply Fears",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/OPEC-Poised-to-Keep-Pumping-Despite-Rising-Oversupply-Fears.html",
      "summary": "OPEC+ will probably continue with its production ramp-up next year regardless of where prices are going, according to traders who believe the expected oversupply in crude will not be large enough to discourage OPEC+ from boosting output. Bloomberg su",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "ConocoPhillips Hits New Gas Discovery in Australia’s Otway Basin",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/ConocoPhillips-Hits-New-Gas-Discovery-in-Australias-Otway-Basin.html",
      "summary": "ConocoPhillips has made a natural gas discovery in the Otway Basin off the Australian coast, the company said today, adding that the reserves tapped and their commercial viability have yet to be estimated. “The Essington-1 well is the first discovery",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Prices Slip as Critical Russian Port Comes Back Online",
      "link": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Slip-as-Critical-Russian-Port-Comes-Back-Online.html",
      "summary": "Oil prices moved lower in early Asian trading on Monday, erasing the modest gains posted last week, as crude loadings resumed at the key Russian export hub of Novorossiysk following a two-day suspension of operations at the Black Sea port. At the tim",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Global LNG Glut Could Upend Prices by 2026",
      "link": "https://oilprice.com/Energy/Natural-Gas/Global-LNG-Glut-Could-Upend-Prices-by-2026.html",
      "summary": "Global LNG supply is rising and growth will accelerate in the next two years as major projects in the top exporters, the United States and China, come on stream. Supply growth is set to outpace the global LNG demand increase, leading to an oversuppli",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The Fossil Fuel Lobby Is Under Scrutiny at COP30",
      "link": "https://oilprice.com/The-Environment/Global-Warming/The-Fossil-Fuel-Lobby-Is-Under-Scrutiny-at-COP30.html",
      "summary": "In recent years, a growing number of fossil fuel lobbyists have attended the annual United Nations COP climate summits. Previously, host country leaders and event organisers have justified the attendance of these lobbyists by saying that they play an",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "A Breakout Year for E-Methanol",
      "link": "https://oilprice.com/Energy/Energy-General/A-Breakout-Year-for-E-Methanol.html",
      "summary": "With COP30 now underway in Belém, Brazil, it can feel as though the world is backsliding when it comes to curbing emissions. Since the last climate summit, major oil companies have scaled back their climate goals, the U.S. has cancelled billions in c",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "How Labour Plans to Make the U.K. a Clean Energy Superpower",
      "link": "https://oilprice.com/Energy/Energy-General/How-Labour-Plans-to-Make-the-UK-a-Clean-Energy-Superpower.html",
      "summary": "Since the Labour Party came into power in the United Kingdom in July 2024, there has been a major change in the government’s approach to energy. The U.K. is now rapidly transitioning away from fossil fuels towards green alternatives, with ambitious c",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}