{
  "last_updated": "2025-11-15 12:32",
  "items": [
    {
      "title": "Renewables Are Too Cheap to Fail",
      "link": "https://oilprice.com/Energy/Energy-General/Renewables-Are-Too-Cheap-to-Fail.html",
      "summary": "Renewable energy has encountered a strange crossroads – it is more successful, and also more divisive, than ever before. Wind and solar have become so successful that they’re not really alternative anymore – they’ve fully entered the mainstream. Not ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Armenia Announces 2026 Start Date for Key Middle Corridor Trade Route",
      "link": "https://oilprice.com/Energy/Energy-General/Armenia-Announces-2026-Start-Date-for-Key-Middle-Corridor-Trade-Route.html",
      "summary": "Construction of a key cog in the Middle Corridor trade network known as TRIPP should begin during the second half of 2026, according to Armenian Prime Minister Nikol Pashinyan. TRIPP, or the Trump Route for International Peace and Prosperity, is a ce",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Enbridge Moves to Rewrite North America’s Heavy-Crude Map",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Enbridge-Moves-to-Rewrite-North-Americas-Heavy-Crude-Map.html",
      "summary": "Enbridge has approved a $1.4 billion expansion across its Mainline and Flanagan South systems that will push more Canadian heavy crude into the U.S. Midwest and down to the Gulf Coast—right where coking refineries are built to run it. Phase 1 of the ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "US Oil Drilling Picks Up: Baker Hughes",
      "link": "https://oilprice.com/Energy/Crude-Oil/US-Oil-Drilling-Picks-Up-Baker-Hughes.html",
      "summary": "The total number of active drilling rigs for oil and gas in the United States rose this week, according to new data that Baker Hughes published on Friday. The total rig count in the US rose by 1 to 549 this week, according to Baker Hughes, down 35 fr",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "India’s Refiners Turn to the U.S. in Break from the Gulf",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Indias-Refiners-Turn-to-the-US-in-Break-from-the-Gulf.html",
      "summary": "India’s state-run refiners have locked in their first-ever long-term deal to import U.S. liquefied petroleum gas (LPG), awarding tenders to Chevron, Phillips 66, and TotalEnergies Trading for delivery beginning in 2026—a move that marks a geopolitica",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "EC Conditionally Approves ADNOC’s $17-Billion Acquisition of Covestro",
      "link": "https://oilprice.com/Energy/Energy-General/EC-Conditionally-Approves-ADNOCs-17-Billion-Acquisition-of-Covestro.html",
      "summary": "The European Commission has approved with conditions the $17-billion acquisition by Abu Dhabi National Oil Company (ADNOC) of Germany’s chemicals giant Covestro, the EU’s executive arm said on Friday, following an investigation into foreign subsidies",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Germany Slashes Capacity to Tender for New Gas Plants",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Germany-Slashes-Capacity-to-Tender-for-New-Gas-Plants.html",
      "summary": "Germany’s ruling coalition has slashed in half the capacity of new natural gas-fired power plants it aims to tender by 2032 in a significant scale-down from the previously planned 20 GW of new gas capacity. The governing coalition led by conservative",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iran Seizes Oil Tanker in Gulf of Oman",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Iran-Seizes-Oil-Tanker-in-Gulf-of-Oman.html",
      "summary": "Iran seized on Friday an oil tanker en route to Singapore after it passed the critical Strait of Hormuz in the Middle East in the first major escalation of the tensions in the region since the Iran-Israel war in June.  The Marshall Islands-flagged oi",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Black Sea Oil Disruption Fails to Shake Bearish Market Mood",
      "link": "https://oilprice.com/Energy/Energy-General/Black-Sea-Oil-Disruption-Fails-to-Shake-Bearish-Market-Mood.html",
      "summary": "The key Russian oil port of Novorossiysk on the Black Sea suspended oil exports on Friday, following a major Ukrainian attack on the port overnight. Friday, November 14, 2025The Russia-Ukraine war rages on, with Ukraine’s drone attacks temporarily ha",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The $100 Million Corruption Scandal Undermining Zelenskyy",
      "link": "https://oilprice.com/Geopolitics/Europe/The-100-Million-Corruption-Scandal-Undermining-Zelenskyy.html",
      "summary": "The central figure in the corruption scandal shaking Ukraine, Tymur Mindich, is an old friend and former business partner of President Volodymyr Zelenskyy.Law enforcement sources say Mindich left the country shortly before police searched his home.An",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}