{
  "last_updated": "2026-02-17 11:02",
  "items": [
    {
      "title": "Oil Bears Are Dangerously Underestimating Geopolitical Risk",
      "link": "https://oilprice.com/Energy/Energy-General/Oil-Bears-Are-Dangerously-Underestimating-Geopolitical-Risk.html",
      "summary": "For decades, oil prices could swing wildly on even the distant prospect of war in the Middle East. With U.S. shale, that changed, leading many to assume that anything short of an oil blockade in the Strait of Hormuz will leave oil markets cold—and su",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Suriname's Oil Boom Faces Economic Headwinds Despite Major Discovery",
      "link": "https://oilprice.com/Energy/Energy-General/Surinames-Oil-Boom-Faces-Economic-Headwinds-Despite-Major-Discovery.html",
      "summary": "A slew of high-quality oil discoveries in offshore Block 58 by TotalEnergies and its 50% partner, APA Corporation, has seen the tiny South American country of Suriname touted as the next Guyana. While Suriname’s offshore waters hold considerable petr",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Germany’s Mukran LNG Terminal Reopens After Frozen Baltic Is Cleared",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Germanys-Mukran-LNG-Terminal-Reopens-After-Frozen-Baltic-Is-Cleared.html",
      "summary": "Operations at the Mukran LNG terminal in Germany’s Baltic Sea have resumed following successful icebreaking operations to clear a navigable channel. The facility had been temporarily disrupted by heavy sea ice, preventing cargo ships from departing.S",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Hungary Seeks Croatian Help As Russian Oil Flows Via Ukraine Halted",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Hungary-Seeks-Croatian-Help-As-Russian-Oil-Flows-Via-Ukraine-Halted.html",
      "summary": "Hungary and Slovakia have formally requested that Croatia authorize the transit of Russian crude oil via the Adriatic pipeline, following the complete suspension of oil flows through the Ukrainian section of the Druzhba pipeline, which has been out o",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Why Chevron Is Betting Big on Venezuela’s Heavy Crude",
      "link": "https://oilprice.com/Energy/Energy-General/Why-Chevron-Is-Betting-Big-on-Venezuelas-Heavy-Crude.html",
      "summary": "The headlines in early 2026 have been dominated by political upheaval in Caracas. Following the dramatic events of early January and the overhaul of Venezuela’s Hydrocarbons Law on January 29, analysts have rushed to debate the morality of renewed Am",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Eni Makes Major Gas Discovery Offshore Ivory Coast",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Eni-Makes-Major-Gas-Discovery-Offshore-Ivory-Coast.html",
      "summary": "Eni has made a major natural gas and condensate discovery offshore the Ivory Coast in Africa, in part of what is estimated to be the second largest discovery in the country after Baleine, the Italian energy major said on Monday.  Eni has focused on e",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Chevron-Led Joint Venture Signs Major Gas Exploration Deal Offshore Greece",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Chevron-Led-Joint-Venture-Signs-Major-Gas-Exploration-Deal-Offshore-Greece.html",
      "summary": "A Chevron-led consortium on Monday signed the lease contracts for oil and gas exploration offshore Greece as the southern European country aims to become a major gas supplier in the Mediterranean.   Chevron, in partnership with Helleniq Energy, signe",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "China Secures Record Russian Oil Imports as India Reduces Purchases",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/China-Secures-Record-Russian-Oil-Imports-as-India-Reduces-Purchases.html",
      "summary": "China’s oil imports from Russia are on track for all-time high of over 2 million barrels per day in February as India is withdrawing from Russian spot purchases and supply is now heavily discounted for Chinese independent refiners.    China is set to",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}