{
  "last_updated": "2026-02-20 09:52",
  "items": [
    {
      "title": "Spot Prices Wrap: Midwest Gains Lift Spot Gas as Traders Brace for Cold",
      "link": "https://naturalgasintel.com/news/spot-prices-wrap-midwest-gains-lift-spot-gas-as-traders-brace-for-cold/",
      "summary": "Cash gas prices rose for Friday delivery at key heating-demand hubs ahead of a weekend cold shot, lifting the national average despite weakness in other regions.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Snapshot: Natural Gas Cash Prices Climb Ahead of Weekend Chills",
      "link": "https://naturalgasintel.com/news/midday-snapshot-natural-gas-cash-prices-climb-ahead-of-weekend-chills/",
      "summary": "Regional exceptions aside, overall spot prices for natural gas strengthened on Thursday as a northern cold front threatened to get furnaces cranking.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Why South Central Storage Deficit Matters for Summer 2026 Natural Gas Prices",
      "link": "https://naturalgasintel.com/news/why-south-central-storage-deficit-matters-for-summer-2026-natural-gas-prices/",
      "summary": "Forward fixed natural gas prices for the coming summer in the South Central were relatively high at the mid-point of this week, reflecting expectations for mounting LNG demand and summer cooling needs to challenge operators as they rebuild depleted u",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Permian Falls, Canada Firms as Natural Gas Forward Market Reprices Spring Risk",
      "link": "https://naturalgasintel.com/news/permian-falls-canada-firms-as-natural-gas-forward-market-reprices-spring-risk/",
      "summary": "A sharp breakdown in West Texas pricing and a moderating Northeast is testing the forward curve, exposing a widening divide between supply-heavy basins and more balanced markets in the west.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Futures: Natural Gas Market Adrift as Traders Sort Through Mixed Signals",
      "link": "https://naturalgasintel.com/news/midday-futures-natural-gas-market-adrift-as-traders-sort-through-mixed-signals/",
      "summary": "Natural gas futures were near even at midday on Thursday, with looming heating demand offsetting a modestly bearish federal inventory report.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Midmorning Markets: Natural Gas Futures Stumble on Nearly In-Line EIA Storage Report",
      "link": "https://naturalgasintel.com/news/midmorning-markets-natural-gas-futures-stumble-on-nearly-in-line-eia-storage-report/",
      "summary": "The U.S. Energy Information Administration (EIA) on Thursday reported a 144 Bcf net withdrawal of natural gas from storage for the week ended Feb. 13, a result that more closely resembled consensus estimates than the past two reports.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Why Has Asian LNG Spot Buying Been So Sluggish?",
      "link": "https://naturalgasintel.com/news/why-has-asian-lng-spot-buying-been-so-sluggish/",
      "summary": "Click here to listen to the latest episode of NGI’s Hub & Flow. NGI’s Jamison Cocklin, managing editor of LNG, talks with Davenport Energy’s Toby Copson, managing partner and portfolio manager, about where things stand in the Asian LNG market as wint",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Libya’s Oil Licensing Round Fails to Deliver Promised Comeback",
      "link": "https://oilprice.com/Energy/Energy-General/Libyas-Oil-Licensing-Round-Fails-to-Deliver-Promised-Comeback.html",
      "summary": "Libya’s first oil licensing round in more than 17 years, launched by the National Oil Corporation (NOC) in March 2025, was meant to signal the country’s upstream comeback after more than a decade of war and fragmentation. The round offered 22 onshore",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Bulgaria's Lukoil Refinery Slashes Costs By $8 Million",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Bulgarias-Lukoil-Refinery-Slashes-Costs-By-8-Million.html",
      "summary": "Bulgaria’s Lukoil Neftohim Burgas refinery has saved $8 million in just two months after dropping its Swiss-based trading intermediary Litasco SA, with Special Commercial Administrator Rumen Spetsov telling Russia’s parliamentary committee that the s",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Hungary Weighs Cutting Power and Gas Shipments to Ukraine",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Hungary-Weighs-Cutting-Power-and-Gas-Shipments-to-Ukraine.html",
      "summary": "Hungary is weighing the idea of cutting off power and natural gas deliveries to Ukraine if Kyiv doesn’t hasten to resume Russian oil flows via the Druzhba pipeline, the chief of staff of Hungarian Prime Minister Viktor Orban said on Thursday. At the ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "EIA: US Crude Oil Inventories Slump As Demand Rises",
      "link": "https://oilprice.com/Energy/Crude-Oil/EIA-US-Crude-Oil-Inventories-Slump-As-Demand-Rises.html",
      "summary": "Crude oil inventories in the United States decreased by 9 million barrels during the week ending February 13, according to new data from the U.S. Energy Information Administration (EIA) released on Thursday. The decrease brings commercial stockpiles ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Demand Slumped by 614,000 Bpd in December on U.S. Decline",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Demand-Slumped-by-614000-Bpd-in-December-on-US-Decline.html",
      "summary": "Global oil demand fell by 614,000 barrels per day (bpd) in December compared to November 2025, and plunged by 536,000 bpd from December 2024, driven by lower U.S. demand, the monthly report by the Joint Organizations Data Initiative (JODI) showed on ",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}