{
  "last_updated": "2026-01-23 09:09",
  "items": [
    {
      "title": "Spot Prices Wrap: Cash Market Buyers Send Natural Gas Soaring Amid Deep Freeze",
      "link": "https://naturalgasintel.com/news/spot-prices-wrap-cash-market-buyers-send-natural-gas-soaring-amid-deep-freeze/",
      "summary": "Spot gas prices spiked on Thursday and rallied for a third consecutive session this week as competition for heating fuel intensified amid forecasts for the coldest conditions of the winter to date.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Futures Settle: Natural Gas Prices Extend Winning Ways Amid Piercing Chills, but Momentum Eases",
      "link": "https://naturalgasintel.com/news/futures-settle-natural-gas-prices-extend-winning-ways-amid-piercing-chills-but-momentum-eases/",
      "summary": "The extreme cold that blanketed portions of the North on Thursday was poised to expand across much of the Lower 48, generating lofty heating demand expectations and lifting natural gas futures. The frosty setup overshadowed a lean storage print as tr",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Snapshot: Natural Gas Cash Prices Blast Off Ahead of Cold Snap",
      "link": "https://naturalgasintel.com/news/midday-snapshot-natural-gas-cash-prices-blast-off-ahead-of-cold-snap/",
      "summary": "A bone-chilling Arctic air mass threatened to disrupt Lower 48 natural gas production, power generation and LNG exports, wreaking havoc in the day-ahead gas market on Thursday.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Venture Global Cleared in Repsol Case Amid Ongoing LNG Contract Battles",
      "link": "https://naturalgasintel.com/news/venture-global-cleared-in-repsol-case-amid-ongoing-lng-contract-battles/",
      "summary": "An international business tribunal has ruled Venture Global Inc. abided by its sales and purchase agreement with Repsol SA while Calcasieu Pass LNG commissioning was delayed, landing the export developer another arbitration win.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Winter Weather Boosts U.S. Imports of Canadian Gas Near 8 Bcf/d",
      "link": "https://naturalgasintel.com/news/winter-weather-boosts-us-imports-of-canadian-gas-near-8-bcfd/",
      "summary": "As freezing winter weather looms across the Lower 48, Canadian natural gas imports have broken past the winter season high, with net daily flows near 8 Bcf/d and averaging 6.23 Bcf/d through Jan. 22.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Pipeline-Constrained Northeast Sees Big Gains as Historic Cold Jolts Natural Gas Forward Prices",
      "link": "https://naturalgasintel.com/news/pipeline-constrained-northeast-sees-big-gains-as-historic-cold-jolts-natural-gas-forward-prices/",
      "summary": "Severe winter forecasts propelled natural gas forward prices during the Jan. 15–21 trading period as some of the coldest weather in 80 years appeared poised to touch nearly every corner of the country.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Futures: Bullish Storage Surprise Punctuates Meteoric Natural Gas Rally",
      "link": "https://naturalgasintel.com/news/midday-futures-bullish-storage-surprise-punctuates-meteoric-natural-gas-rally/",
      "summary": "A third straight session of stout gains for prompt month natural gas futures was well under way Thursday when the U.S. Energy Information Administration (EIA) confirmed a heavier than expected weekly storage decline, further fueling bullish excitemen",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Midmorning Markets: Natural Gas Rally Endures as EIA Draw Beats Estimates, Trails Historical Averages",
      "link": "https://naturalgasintel.com/news/midmorning-markets-natural-gas-rally-endures-as-eia-draw-beats-estimates-trails-historical-averages/",
      "summary": "The U.S. Energy Information Administration (EIA) reported a 120 Bcf natural gas storage withdrawal that exceeded market expectations but lagged historical benchmarks, keeping futures biased to the upside.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Former NatGas Trader Reveals How to Strike Amid Infrastructure Squeezes, Weather Volatility",
      "link": "https://naturalgasintel.com/news/former-natgas-trader-reveals-how-to-strike-amid-infrastructure-squeezes-weather-volatility/",
      "summary": "Click here to listen to the latest episode of Hub & Flow in which NGI seeks insights from NatGasHub.com founder Jay Bhatty on navigating a volatile commodity landscape as the market braces for the next major cold snap.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Eastern Canada LNG Back in Focus as Hanwha Enters Newfoundland Project",
      "link": "https://naturalgasintel.com/news/eastern-canada-lng-back-in-focus-as-hanwha-enters-newfoundland-project/",
      "summary": "South Korea’s Hanwha Group is expanding its potential LNG portfolio in North America with a tentative partnership to advance a proposed export project in Newfoundland and Labrador.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Trump Claims UK Has 500 Years Of Oil Reserves Left In The North Sea",
      "link": "https://oilprice.com/Energy/Energy-General/Trump-Claims-UK-Has-500-Years-Of-Oil-Reserves-Left-In-The-North-Sea.html",
      "summary": "The U.S. stock market has pared back heavy losses it posted earlier in the week after U.S. President Donald Trump relented on his threat to slap European and NATO nations with tariffs for opposing his push to acquire Greenland. Trump also ruled out t",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Why American Shale Know-How Is Becoming a Global Export",
      "link": "https://oilprice.com/Energy/Crude-Oil/Why-American-Shale-Know-How-Is-Becoming-a-Global-Export.html",
      "summary": "As U.S. shale production plateaus, America’s frackers are looking at opportunities abroad to tap new growth markets and develop emerging shale basins overseas, leveraging two decades of experience and technological innovation. Opportunities abound—fr",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Why Russia's Diesel Exports Are Suddenly Soaring",
      "link": "https://oilprice.com/Energy/Energy-General/Why-Russias-Diesel-Exports-Are-Suddenly-Soaring.html",
      "summary": "Russian diesel has moved from being the main bullish factor in global middle-distillate markets in 2025 to an overwhelmingly bearish force by early 2026, reversing a year-long surge in refining margins. The European diesel crack spread rose from $16.",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Only a Fraction of Venezuela's Oil Is Economically Recoverable",
      "link": "https://oilprice.com/Energy/Crude-Oil/Only-a-Fraction-of-Venezuelas-Oil-Is-Economically-Recoverable.html",
      "summary": "Venezuela is often described as sitting atop the largest oil reserves on Earth. Officially, the country reports more than 300 billion barrels of proven oil—more than Saudi Arabia. To many readers, that figure implies vast, untapped wealth waiting onl",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Why Colombia Is Redesigning Its Natural Gas Network",
      "link": "https://oilprice.com/Energy/Energy-General/Why-Colombia-Is-Redesigning-Its-Natural-Gas-Network.html",
      "summary": "As domestic onshore supply continues to decline, higher LNG imports are a must for the country, and after 2031, it could have the option to produce offshore gas from Sirius, pending its FID. With the alternatives in hand, the Caribbean coast will inc",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}