{
  "last_updated": "2025-12-27 06:08",
  "items": [
    {
      "title": "Public Ownership Won’t Cure Power Market Volatility",
      "link": "https://oilprice.com/Alternative-Energy/Renewable-Energy/Public-Ownership-Wont-Cure-Power-Market-Volatility.html",
      "summary": "There are at least two places, San Francisco and the mid-Hudson Valley in New York, where political activists are currently advocating for a public takeover of the local investor-owned utility. Pacific Gas and Electric is owned by utility holding com",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "How Trump’s Venezuelan Blockade Is Disrupting Oil Flows to China and Cuba",
      "link": "https://oilprice.com/Energy/Crude-Oil/How-Trumps-Venezuelan-Blockade-Is-Disrupting-Oil-Flows-to-China-and-Cuba.html",
      "summary": "The Trump administration has ordered the U.S. military to enforce a two-month \"quarantine\" of Venezuelan oil, signaling an intensification of gunboat diplomacy aimed at fostering regime instability in Caracas, with potential spillover effects that co",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Turkey Makes Another $9 Billion Bet on Russian Nuclear Power",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Turkey-Makes-Another-9-Billion-Bet-on-Russian-Nuclear-Power.html",
      "summary": "Turkey just took another very large, very deliberate step deeper into Russia’s energy orbit — and this time it comes with a $9 billion price tag. Ankara says that Russia has provided $9 billion in new financing for the Akkuyu nuclear power plant, Tur",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iraq and Kurdistan Extend Oil Export Deal to March 2026",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Iraq-and-Kurdistan-Extend-Oil-Export-Deal-to-March-2026.html",
      "summary": "Iraq and Kurdistan agreed this week to extend a deal for the export of crude oil from the northern semi-autonomous region until March 2026, Rudaw reported, citing the head of Iraq’s State Oil Marketing Organization. “The three sides - the federal gov",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Geopolitics Lifts Oil Prices in Thin Holiday Trading",
      "link": "https://oilprice.com/Energy/Energy-General/Geopolitics-Lifts-Oil-Prices-in-Thin-Holiday-Trading.html",
      "summary": "Oil prices nudged higher on Boxing Day as geopolitical risk rises in the markets. Friday, December 26, 2025The festive Christmas lull in oil trading saw oil prices post a weekly gain as geopolitical tensions helped push ICE Brent above the $62 per ba",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "China Issues First 2026 Fuel Export Quotas",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/China-Issues-First-2026-Fuel-Export-Quotas.html",
      "summary": "China has issued the first batch of fuel export quotas for the new year, at a total of 19 million tons, Reuters reported today, citing unnamed sources. The volumes were relatively unchanged on the first fuel export quota batch for this year. The quot",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Russia's Oil Output Held Steady in 2025",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Russias-Oil-Output-Held-Steady-in-2025.html",
      "summary": "Russia’s crude oil production this year will remain unchanged from the previous year at some 516 million tons, Deputy Prime Minister Alexander Novak said today, adding that in 2026, oil production should rise to 525 million tons, Interfax cited the o",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Prices Set for Largest Weekly Gain in Three Months",
      "link": "https://oilprice.com/Energy/Oil-Prices/Oil-Prices-Set-for-Largest-Weekly-Gain-in-Three-Months.html",
      "summary": "Crude oil prices were set for the most substantial gain since October this week amid intensifying U.S. pressure on Venezuela, with both Brent crude and West Texas Intermediate gaining over $2 per barrel in the last full week of 2025. A newly reported",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}