{
  "last_updated": "2025-11-14 15:34",
  "items": [
    {
      "title": "Carlyle Eyes Lukoil Assets After Gunvor's $22 Billion Deal Collapses",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Carlyle-Eyes-Lukoil-Assets-After-Gunvors-22-Billion-Deal-Collapses.html",
      "summary": "Carlyle is in talks with Lukoil for the potential acquisition of the latter’s international operations, Reuters has reported, citing unnamed sources. The news follows Gunvor’s attempt to buy the assets, only to change its mind after the Trump adminis",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Prices Jump as Ukraine Hits One of Russia’s Biggest Export Hubs",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Jump-as-Ukraine-Hits-One-of-Russias-Biggest-Export-Hubs.html",
      "summary": "Oil prices climbed in early Asian trade on Friday as markets responded to renewed attacks by Ukraine against energy infrastructure in Russia. A Ukrainian drone attack on the Russian Black Sea port of Novorossiysk, one of the country’s most important ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Diesel Spreads Hit Near Two-Year Peak After India Cuts Russian Crude Purchases",
      "link": "https://oilprice.com/Energy/Crude-Oil/Diesel-Spreads-Hit-Near-Two-Year-Peak-After-India-Cuts-Russian-Crude-Purchases.html",
      "summary": "Recently, Bloomberg reported that five of India's largest oil refiners have made no purchases of Russian crude for December delivery, instead turning to Saudi Arabia, UAE and Iraq for crude with similar properties to Urals. The move comes after Washi",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "New President Vows to End Bolivia’s Energy Crisis",
      "link": "https://oilprice.com/Energy/Crude-Oil/New-President-Vows-to-End-Bolivias-Energy-Crisis.html",
      "summary": "Rodrigo Paz, the centrist senator who won the presidential election in Bolivia last month, was sworn in this weekend and immediately set to work to undo the policies of 20 years of nearly-uninterrupted socialist rule. In the first round of the presid",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Trump’s Energy Pushback Sends Shockwaves Through Wind Industry",
      "link": "https://oilprice.com/Alternative-Energy/Wind-Power/Trumps-Energy-Pushback-Sends-Shockwaves-Through-Wind-Industry.html",
      "summary": "The energy transition faces the biggest challenge yet as a global backlash against renewable energy – spearheaded by U.S. President Donald Trump – is gaining momentum, according to two of the European pioneers of wind turbine design. President Trump’",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Beijing Lures Private Investors to Reignite Infrastructure Growth",
      "link": "https://oilprice.com/Energy/Energy-General/Beijing-Lures-Private-Investors-to-Reignite-Infrastructure-Growth.html",
      "summary": "After decades of funding major infrastructure projects with state money, the Chinese government has zeroed in on private capital as a source of fresh cash for big projects in everything from transport to energy, to power generation, and drones. In a ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Offshore Pumped Hydro Could Solve Clean Energy's Biggest Problem",
      "link": "https://oilprice.com/Energy/Energy-General/Offshore-Pumped-Hydro-Could-Solve-Clean-Energys-Biggest-Problem.html",
      "summary": "The global energy storage sector is heating up to be “clean energy’s next trillion-dollar business.” As more nations around the world become increasingly reliant on renewable energies to power their grids and the AI boom pushes clean energy expansion",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Bechtel Chief Says U.S. Must Subsidize Trump’s Nuclear Revival",
      "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Bechtel-Chief-Says-US-Must-Subsidize-Trumps-Nuclear-Revival.html",
      "summary": "Well, someone important finally said it. Craig Albert, head of construction firm Bechtel, credited by the Financial Times for “rescuing” the Vogtle nuclear project in Georgia (we think “finishing“ it would be a better description), told that august p",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Germany Caps Power Prices to Save Its Industrial Base",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Germany-Caps-Power-Prices-to-Save-Its-Industrial-Base.html",
      "summary": "Germany has agreed to subsidize electricity for its heavy industries, capping prices at about €0.05 per kilowatt-hour from 2026 through 2028—a major policy move aimed at keeping its industrial base from eroding under the weight of Europe’s soaring en",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The Remarkable Rise of Natural Gas",
      "link": "https://oilprice.com/Energy/Energy-General/The-Remarkable-Rise-of-Natural-Gas.html",
      "summary": "As oil prices struggle to find a footing in the wake of the latest OPEC moves, natural gas has stepped into a standout role in the global energy mix. This year, the demand and price trends for natural gas underscore both its resilience and its growin",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}