{
  "last_updated": "2025-12-12 10:57",
  "items": [
    {
      "title": "Israel: FLNG Import Terminal Gets Shipment",
      "link": "https://www.lngworldnews.com/israel-flng-import-terminal-gets-shipment/",
      "summary": "Israel's inaugural floating liquefied natural gas (FLNG) terminal has received its maiden shipment of LNG from BP\nThe post Israel: FLNG Import Terminal Gets Shipment appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "India’s Gorgon Project to Supply Petronet’s Kochi LNG Terminal",
      "link": "https://www.lngworldnews.com/india-gorgon-to-supply-petronets-kochi-lng-terminal/",
      "summary": "In a significant development for India's energy landscape, the Gorgon liquefied natural gas (LNG) project in Australia is set to supply LNG to Petronet's Kochi LNG terminal.\nThe post India&#8217;s Gorgon Project to Supply Petronet&#8217;s Kochi LNG T",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Seizing Venezuelan Oil May Cost Washington More Than Caracas",
      "link": "https://oilprice.com/Energy/Crude-Oil/Seizing-Venezuelan-Oil-May-Cost-Washington-More-Than-Caracas.html",
      "summary": "On Wednesday, the United States carried out one of its most consequential maritime interventions to date. The Federal Bureau of Investigation, Homeland Security Investigations, and the United States Coast Guard, acting with support from the Departmen",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Trump Zeros In on Venezuela’s Oil Networks",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Zeros-In-on-Venezuelas-Oil-Networks.html",
      "summary": "Washington moved aggressively back into Venezuela’s oil sector on Thursday, sanctioning Maduro family members, a longtime business ally, and six companies operating tankers that have kept PDVSA’s exports alive through opaque shipping practices. It’s ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Canada’s Cenovus Energy To Boost 2026 Oil Production",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Canadas-Cenovus-Energy-To-Boost-2026-Oil-Production.html",
      "summary": "Cenovus Energy expects its upstream production to rise by about 4% in 2026 compared to this year as it is completing new projects and adding assets of MEG Energy, which it recently acquired.  Cenovus Energy’s 2026 capital budget released on Thursday ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Russian Oil Cargo to Georgia Draws Fresh Allegations of Sanctions Evasion",
      "link": "https://oilprice.com/Energy/Energy-General/Russian-Oil-Cargo-to-Georgia-Draws-Fresh-Allegations-of-Sanctions-Evasion.html",
      "summary": "A background report published by a leading transparency watchdog group in Tbilisi highlights the sketchy ownership structure of a tanker that delivered oil from Russia to Georgia, raising suspicions that the shipment was part of a sanctions-busting e",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Equinor Invests $400 Million to Boost Output at Newest Arctic Oilfield",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Equinor-Invests-400-Million-to-Boost-Output-at-Newest-Arctic-Oilfield.html",
      "summary": "Equinor and its partners in the huge new Arctic oilfield Johan Castberg will invest $396 million (4 billion Norwegian crowns) to construct the first tie-back of another discovery to the Castberg hub that would boost oil production from the area.   Th",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}