{
  "last_updated": "2025-12-16 10:08",
  "items": [
    {
      "title": "Natural Gas Futures Slip, but Hold Above $4 as Warm Christmas Forecasts Weigh",
      "link": "https://naturalgasintel.com/news/natural-gas-futures-slip-but-hold-above-4-as-warm-christmas-forecasts-weigh/",
      "summary": "Nymex natural gas futures opened the week under pressure Monday as a colder shift in late December forecasts proved insufficient to counter concerns that early winter heating demand was moderating.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Iran Hikes Gasoline Prices For The First Time Since 2019",
      "link": "https://oilprice.com/Energy/Energy-General/Iran-Hikes-Gasoline-Prices-For-The-First-Time-Since-2019.html",
      "summary": "The Islamic Republic of Iran has announced a fuel price hike for the first time since 2019, with the increase coming at a time when the authorities are struggling with economic pressures and environmental disasters. The new pricing system, which took",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "U.S. Shale Turns From Drilling Faster to Recovering More Oil",
      "link": "https://oilprice.com/Energy/Energy-General/US-Shale-Turns-From-Drilling-Faster-to-Recovering-More-Oil.html",
      "summary": "It has been an eventful year for U.S. shale oil and gas. Low prices—at least in oil—a double down on capital discipline, and drilling efficiency gains that pushed the U.S. total to a record high again were the hallmarks of 2025. The next frontier? Re",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Tanker Seizure Forces Chevron to Slash Prices on Venezuelan Crude",
      "link": "https://oilprice.com/Energy/Crude-Oil/Tanker-Seizure-Forces-Chevron-to-Slash-Prices-on-Venezuelan-Crude.html",
      "summary": "Chevron has quietly cut the price of Venezuelan crude sold to U.S. refiners after American forces seized a tanker off the country’s coast, tightening an already-fragile export channel and adding fresh volatility to Gulf Coast markets. Traders familia",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}