{
  "last_updated": "2026-01-26 09:19",
  "items": [
    {
      "title": "Low Prices, Strong Demand, and the Cracks in the Oil Glut Story",
      "link": "https://oilprice.com/Energy/Crude-Oil/Low-Prices-Strong-Demand-and-the-Cracks-in-the-Oil-Glut-Story.html",
      "summary": "Almost 100% of oil market analysts see the market as oversupplied this year, just as it was oversupplied last year. The size of the supply overhang, however, matters. Led by the International Energy Agency, a lot of analysts predicted that the overha",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "The Looming LNG Glut and What It Means for Global Energy Prices",
      "link": "https://oilprice.com/Energy/Natural-Gas/The-Looming-LNG-Glut-and-What-It-Means-for-Global-Energy-Prices.html",
      "summary": "As several countries invest in expanding their liquid natural gas (LNG) production and export capacity, and significant quantities of the gas are expected to come online in 2026 after a record 2025, supply could soon outpace demand. This begs the que",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Trump Slashes Clean Energy Loans, Bets Big on Gas and Nuclear",
      "link": "https://oilprice.com/Energy/Energy-General/Trump-Slashes-Clean-Energy-Loans-Bets-Big-on-Gas-and-Nuclear.html",
      "summary": "The Trump Administration continues to revise, restructure, and cancel billions of U.S. dollars of Biden-era loans and funding commitments to clean energy projects as the United States shifted its policy to supporting fossil fuels and nuclear power as",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Mexico Weighs Cuba Oil Cut as Trump Pressure Mounts",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Mexico-Weighs-Cuba-Oil-Cut-as-Trump-Pressure-Mounts.html",
      "summary": "Mexico is weighing whether to halt or scale back oil shipments to Cuba as concerns grow within President Claudia Sheinbaum’s government that continuing the policy could trigger retaliation from the United States, according to sources familiar with in",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}