{
  "last_updated": "2025-12-11 09:26",
  "items": [
    {
      "title": "Oil Prices Climb as U.S. Seizes Tanker Off Venezuelan Coast",
      "link": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Climb-as-US-Seizes-Tanker-Off-Venezuelan-Coast.html",
      "summary": "The United States has seized a large oil tanker off the coast of Venezuela, marking a major escalation in tensions between Washington and Caracas and pushing oil prices higher. President Trump confirmed the operation, saying, \"We've just seized a tan",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "China’s Oil Pumping Power Breaks All Records",
      "link": "https://oilprice.com/Energy/Energy-General/Chinas-Oil-Pumping-Power-Breaks-All-Records.html",
      "summary": "China is closing 2025 with the strongest domestic crude output in its modern history, ending its Seven-Year Action Plan (2019–2025) with measurable gains. National production has risen from 3.8 million b/d in 2020 to an average of 4.3 million b/d in ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Is Oil About to Snap Higher? The Market May Be Too Bearish",
      "link": "https://oilprice.com/Energy/Crude-Oil/Short-Term-Oil-Glut-Sets-the-Stage-for-a-Future-Supply-Crunch.html",
      "summary": "Rising oil supply amid tepid demand growth has prompted forecasters and analysts to predict a large surplus on the market going into 2026. All experts and investment banks estimate that the market is accumulating inventories and will continue to do s",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "US Natural Gas Output and Demand to Smash Records in 2025",
      "link": "https://oilprice.com/Energy/Natural-Gas/US-Natural-Gas-Output-and-Demand-to-Smash-Records-in-2025.html",
      "summary": "The production of US natural gas and demand for it will both end the year at record highs, according to the US Energy Information Administration’s Short-Term Energy Outlook cited by Reuters on Dec. 9. For dry gas production and LNG exports, the total",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "AI Becomes a Boost for Global Oil Demand, Not a Bridge to Net Zero",
      "link": "https://oilprice.com/Energy/Crude-Oil/AI-Becomes-a-Boost-for-Global-Oil-Demand-Not-a-Bridge-to-Net-Zero.html",
      "summary": "Artificial intelligence could help the energy industry tap an additional one trillion barrels of oil by making more of these barrels economical to extract. Wood Mackenzie analysts made the prediction recently, adding fuel to an already heated debate:",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Microgrids Set for $17 Billion Boom as Central Grids Fail",
      "link": "https://oilprice.com/Energy/Energy-General/Microgrids-Set-for-17-Billion-Boom-as-Central-Grids-Fail.html",
      "summary": "The global energy landscape is undergoing a decisive structural shift, moving away from the century-old model of centralized utility dependence toward localized, autonomous power networks. According to a new industry report by Credence Research, the ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "EU Unveils $1.4 Trillion Plan to Fix Power Grid Bottlenecks",
      "link": "https://oilprice.com/Energy/Energy-General/EU-Unveils-14-Trillion-Plan-to-Fix-Power-Grid-Bottlenecks.html",
      "summary": "The European Commission is expected to launch a nearly $1.4 trillion (1.2 trillion euros) package to upgrade cross-border electric grids and accelerate planning and permitting as the EU looks to strengthen power links and accommodate a growing share ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Petrobras Workers Announce Nationwide Strike",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Petrobras-Workers-Announce-Nationwide-Strike.html",
      "summary": "Workers at Brazil's Oil & Gas giant Petróleo Brasileiro S.A. (NYSE:PBR), aka Petrobras, have announced a nationwide strike starting December 15, terming the company's latest counteroffer for a labor agreement as \"disrespectful”. Petrobras workers hav",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Can Small Modular Reactors Solve Britain's AI Energy Crunch?",
      "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Can-Small-Modular-Reactors-Solve-Britains-AI-Energy-Crunch.html",
      "summary": "Britain’s AI boom is running straight into an energy wall, and nuclear power was supposed to act as its crutch to get around it. Instead, the government has hit pause, just as data centre demand is set to explode, leading investors wondering whether ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Elon Musk’s SpaceX Targeting $1 Trillion Valuation in 2026 IPO",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Elon-Musks-SpaceX-Targeting-1-Trillion-Valuation-in-2026-IPO.html",
      "summary": "Elon Musk's space transportation company SpaceX is targeting a raise of $25 billion through an initial public offering (IPO) in the coming year, in a move that will give it a valuation of over $1 trillion, making SpaceX one of the world’s most valuab",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}