{
  "last_updated": "2025-11-11 23:22",
  "items": [
    {
      "title": "European Commission approves German LNG terminal joint venture",
      "link": "https://www.lngworldnews.com/european-commission-approves-german-lng-terminal-joint-venture/",
      "summary": "The joint venture between Gasunie, Oiltanking, and Vopak has received approval from the European Commission to establish an LNG joint venture aimed at constructing an LNG terminal in Germany.\nThe post European Commission approves German LNG terminal ",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Wheatstone LNG’s second train 90 pct done",
      "link": "https://www.lngworldnews.com/wheatstone-lngs-second-train-90-pct-done/",
      "summary": "Construction of the second liquefaction train at the Chevron-led Wheatstone LNG project in Western Australia has surpassed 90 percent completion\nThe post Wheatstone LNG’s second train 90 pct done appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Volvo Trucks North America to Launch LNG Engine",
      "link": "https://www.lngworldnews.com/volvo-trucks-north-america-to-launch-lng-engine/",
      "summary": "Volvo Trucks North America is set to introduce its own 13-liter liquefied natural gas (LNG) engine for the North American market in 2014\nThe post Volvo Trucks North America to Launch LNG Engine appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Video: Saipem’s work on Ichthys LNG pipeline",
      "link": "https://www.lngworldnews.com/video-saipems-work-on-ichthys-lng-pipeline/",
      "summary": "Italian oil and gas contractor Saipem was tasked with executing the construction of the 890 km gas export offshore pipeline for the Ichthys LNG project, led by Inpex, in Australia back in 2012.\nThe post Video: Saipem’s work on Ichthys LNG pipeline ap",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "STX Finland and Viking Line Sign Agreement for Cruise Ferry",
      "link": "https://www.lngworldnews.com/stx-finland-and-viking-line-sign-agreement-for-cruise-ferry/",
      "summary": "STX Finland Oy and Viking Line ABP have inked a preliminary agreement to construct an environmentally conscious, next-generation cruise ferry for Viking Line\nThe post STX Finland and Viking Line Sign Agreement for Cruise Ferry appeared first on Lngwo",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Shells prelude flng to start production in 2017",
      "link": "https://www.lngworldnews.com/shells-prelude-flng-to-start-production-in-2017/",
      "summary": "Shell's monumental Prelude FLNG facility is poised to commence chilled gas production offshore Western Australia in 2017\nThe post Shells prelude flng to start production in 2017 appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Nobles Colorado LNG facility moving forward",
      "link": "https://www.lngworldnews.com/nobles-colorado-lng-facility-moving-forward/",
      "summary": "Noble Energy, headquartered in Houston, has confirmed that construction progress on its Keota LNG facility in Colorado is proceeding as planned.\nThe post Nobles Colorado LNG facility moving forward appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Poland: PM Says Nord Stream Will Not Block Development of Polish Ports",
      "link": "https://www.lngworldnews.com/poland-pm-says-nord-stream-will-not-block-development-of-polish-ports/",
      "summary": "In a recent statement, Poland's Prime Minister reassured the nation that the Nord Stream gas pipeline project will not hinder the development of Polish ports. \nThe post Poland: PM Says Nord Stream Will Not Block Development of Polish Ports appeared f",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Israel: FLNG Import Terminal Gets Shipment",
      "link": "https://www.lngworldnews.com/israel-flng-import-terminal-gets-shipment/",
      "summary": "Israel's inaugural floating liquefied natural gas (FLNG) terminal has received its maiden shipment of LNG from BP\nThe post Israel: FLNG Import Terminal Gets Shipment appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "India’s Gorgon Project to Supply Petronet’s Kochi LNG Terminal",
      "link": "https://www.lngworldnews.com/india-gorgon-to-supply-petronets-kochi-lng-terminal/",
      "summary": "In a significant development for India's energy landscape, the Gorgon liquefied natural gas (LNG) project in Australia is set to supply LNG to Petronet's Kochi LNG terminal.\nThe post India&#8217;s Gorgon Project to Supply Petronet&#8217;s Kochi LNG T",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Oil Prices Slip Despite Lukoil Declaring Force Majeure in Iraq",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Slip-Despite-Lukoil-Declaring-Force-Majeure-in-Iraq.html",
      "summary": "Crude oil prices opened lower today even after Russia’s Lukoil declared force majeure on its operations in one of Iraq’s biggest oil fields because of the latest U.S. sanctions. At the time of writing, Brent crude was trading at $63.84 per barrel, wi",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "China's $468 Billion Energy Drive Sparks Global Oil Market Shakeup",
      "link": "https://oilprice.com/Energy/Crude-Oil/Chinas-468-Billion-Energy-Drive-Sparks-Global-Oil-Market-Shakeup.html",
      "summary": "A month ago, Chinese oil heavyweight CNOOC boasted its pipeline network had hit 10,000 kilometers. That network was going to further grow to 13,000 km, the company said soon after it announced a fresh offshore discovery in the South China Sea. What C",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Discounts Deepen Venezuela’s Financial Freefall",
      "link": "https://oilprice.com/Energy/Crude-Oil/Oil-Discounts-Deepen-Venezuelas-Financial-Freefall.html",
      "summary": "Venezuela’s economy is in tatters, putting additional pressure on the country’s embattled leader, Nicolas Maduro, at a time when the U.S. Administration is increasing its military presence in the Caribbean region and striking alleged drug boats offsh",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Goldman Sachs Says AI Boom Will Supercharge Energy Demand",
      "link": "https://oilprice.com/Energy/Energy-General/Goldman-Sachs-Says-AI-Boom-Will-Supercharge-Energy-Demand.html",
      "summary": "Lately, big tech cheerleaders, including Meta Platforms’ (NASDAQ:META) Mark Zuckerberg, Amazon’s (NASDAQ:AMZN) Jeff Bezos and OpenAI’s CEO Sam Altman, have warned we are in an AI bubble, with stock market valuations, heavy speculation and market exub",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Lukoil’s Iraq Exit Marks Major Sanctions Victory for the West",
      "link": "https://oilprice.com/Energy/Energy-General/Lukoils-Iraq-Exit-Marks-Major-Sanctions-Victory-for-the-West.html",
      "summary": "Russia’s second-largest oil producer Lukoil is withdrawing from its core energy interests in Iraq following the recent tightening of the sanctions noose around the country by the West. The latest prohibitions introduced by the U.S. on 22 October incl",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}