{
  "last_updated": "2025-12-09 10:12",
  "items": [
    {
      "title": "Why Oil Prices are Set to Fall Below $60 Next Year",
      "link": "https://oilprice.com/Energy/Crude-Oil/Why-Oil-Prices-are-Set-to-Fall-Below-60-Next-Year.html",
      "summary": "Oil prices are set to average below $60 per barrel next year, investment banks have said in their latest forecasts in recent weeks.  In 2026, both Brent Crude and WTI Crude are expected to slip from current levels of $63 per barrel and $60 a barrel, ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iraq Invites U.S. Firms to Seize Russia’s Oilfield Prize",
      "link": "https://oilprice.com/Energy/Crude-Oil/Iraq-Invites-US-Firms-to-Seize-Russias-Oilfield-Prize.html",
      "summary": "Iraq’s Oil Ministry has revealed that it has sent out exclusive invitations to several major U.S. energy firms to develop the country’s huge West Qurna 2 oilfield following the withdrawal of Russian oil number two Lukoil after Washington ratcheted up",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Carbon Tax Puts EU at Odds With Export Majors",
      "link": "https://oilprice.com/Energy/Crude-Oil/Carbon-Tax-Puts-EU-at-Odds-With-Export-Majors.html",
      "summary": "On January 1 next year, a new tax will come into effect in the European Union. Dubbed the carbon border adjustment mechanism, the tax will be imposed on imports from non-EU countries with less strict emission reduction standards. Those countries are ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "No Breakthrough on Donbas as Zelenskyy Meets With European Allies",
      "link": "https://oilprice.com/Geopolitics/Europe/No-Breakthrough-on-Donbas-as-Zelenskyy-Meets-With-European-Allies.html",
      "summary": "Ukrainian President Volodymyr Zelenskyy met with European leaders seeking to ensure a US-led effort to end Russia's war on Ukraine does not result in a lopsided deal that would reward Moscow for its aggression against its neighbor and leave Kyiv vuln",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Labor Shortages Threaten to Derail Europe's Energy Security Pivot",
      "link": "https://oilprice.com/Energy/Energy-General/Labor-Shortages-Threaten-to-Derail-Europes-Energy-Security-Pivot.html",
      "summary": "The European Union has drawn a line in the sand. By 2027, the bloc intends to phase out Russian natural gas imports completely.  But as the policy ink dries in Brussels, a new challenge is emerging in the real economy… We might not have enough hands ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "National Gas Prices Fall Again To Multi-Year Lows",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/National-Gas-Prices-Fall-Again-To-Multi-Year-Lows.html",
      "summary": "The national average price of gasoline has continued on a downward trend after dropping below $3 a gallon a week ago, sinking to their lowest level since 2021. The median U.S. gas price is now $2.79 per gallon, with the national average 4 cents lower",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Tesla Shares Slip After Morgan Stanley Downgrade",
      "link": "https://oilprice.com/Energy/Energy-General/Tesla-Shares-Slip-After-Morgan-Stanley-Downgrade.html",
      "summary": "Tesla shares slipped more than 4% on Monday after Morgan Stanley cut its rating on the stock to Equal-weight from Overweight, even as the firm raised its price target to $425 from $410. With Tesla changing hands around $455 into the move, the new tar",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Kazakhstan To Supply Crude Directly To China After CPC Pipeline Damage",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Kazakhstan-To-Supply-Crude-Directly-To-China-After-CPC-Pipeline-Damage.html",
      "summary": "Kazakhstan will supply 50,000 metric tons of crude to China directly from the Kashagan oilfield in December after a Ukrainian drone damaged the Caspian Pipeline Consortium (CPC) at the Black Sea terminal, Reuters reported on Monday. The Caspian Pipel",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Europe Fast-Tracks Industrial Electrification With €1B Auction",
      "link": "https://oilprice.com/Energy/Energy-General/Europe-Fast-Tracks-Industrial-Electrification-With-1B-Auction.html",
      "summary": "The European Commission’s announcement of the first-ever EU-wide industrial electrification auction marks more than a new funding mechanism; it represents a philosophical shift in how Europe intends to decarbonize its industries, and a signal that, a",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "A Supply Crisis is Looming for Metals With No Dedicated Mines",
      "link": "https://oilprice.com/Metals/Commodities/A-Supply-Crisis-is-Looming-for-Metals-With-No-Dedicated-Mines.html",
      "summary": "When we hear the word \"byproduct,\" it often designates something unwanted or even negative coming out of a decision or process that provides some product or outcome we do want. In the world of mining, however, byproducts are often valuable minerals p",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}