{
  "last_updated": "2026-01-12 09:13",
  "items": [
    {
      "title": "Global Upstream Capex Set To Fall Again In 2026 Amid Low Oil Prices",
      "link": "https://oilprice.com/Energy/Crude-Oil/Global-Upstream-Capex-Set-To-Fall-Again-In-2026-Amid-Low-Oil-Prices.html",
      "summary": "Last year, upstream oil investment was projected to have declined 2.5% Y/Y to $420 billion after low oil prices put pressure on producers and slowed expansion plans. Companies across the industry continued to prioritize profitability, free cash flow,",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Iran’s Oil Output Faces a New Test After Venezuela",
      "link": "https://oilprice.com/Energy/Energy-General/Irans-Oil-Output-Faces-a-New-Test-After-Venezuela.html",
      "summary": "In recent months, Iran has produced record levels of oil, even in the face of United States sanctions on its energy exports and the bombings conducted by Israel on Tehran. Iran has forged strong partnerships with China and other world powers to circu",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Audit Uncovers $30 Million Net Loss at Tajikistan's Power Megaproject",
      "link": "https://oilprice.com/Energy/Energy-General/Audit-Uncovers-30-Million-Net-Loss-at-Tajikistans-Power-Megaproject.html",
      "summary": "The numbers are not adding up at Tajikistan’s signature infrastructure project, the Rogun Dam. An independent audit of the project’s financial statements has found a $540 million accounting gap and has determined that electricity-production operation",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Somalia Bets on Solar and Wind as Power Demand Grows",
      "link": "https://oilprice.com/Energy/Energy-General/Somalia-Bets-on-Solar-and-Wind-as-Power-Demand-Grows.html",
      "summary": "Somalia has lagged many other African countries when it comes to energy output, despite its strong potential for renewable energy production. Much of Somalia’s population still does not have access to electricity or clean cooking fuels. However, grea",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}