{
  "last_updated": "2026-02-19 17:27",
  "items": [
    {
      "title": "Futures Settle: Strong Output, Soft Demand Tilt Risk Lower for Natural Gas Futures",
      "link": "https://naturalgasintel.com/news/futures-settle-strong-output-soft-demand-tilt-risk-lower-for-natural-gas-futures/",
      "summary": "March natural gas futures struggled Wednesday to hold above the psychologically important $3.00/MMBtu mark as traders looked past a brief burst of cold toward spring demand erosion and rising storage.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Golden Pass LNG Activity Normalizes; Permian Lateral Cleared to Proceed",
      "link": "https://naturalgasintel.com/news/golden-pass-lng-activity-normalizes-permian-lateral-cleared-to-proceed/",
      "summary": "Nominations to the Golden Pass LNG facility have been revised down and returned to average levels after two days of reported spikes in flows, according to Wood Mackenzie pipeline data.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Snapshot: Natural Gas Spot Prices Retreat as Spring Weather Nears",
      "link": "https://naturalgasintel.com/news/midday-snapshot-natural-gas-spot-prices-retreat-as-spring-weather-nears/",
      "summary": "Day-ahead natural gas cash prices trended lower as of early afternoon on Wednesday, hampered by stout supply and bearish weather outlooks.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "TC Energy Forecasts Natural Gas Demand Surge Equivalent to Entire European Market",
      "link": "https://naturalgasintel.com/news/tc-energy-forecasts-natural-gas-demand-surge-equivalent-to-entire-european-market/",
      "summary": "TC Energy Corp. projects North American natural gas demand will jump by 45 Bcf/d by 2035, driven by LNG exports, rising power generation, and growing reliability needs at distribution companies.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Futures: Bears Sink Claws Deeper into Natural Gas Prices",
      "link": "https://naturalgasintel.com/news/midday-futures-bears-sink-claws-deeper-into-natural-gas-prices/",
      "summary": "Technical support failed as stout production and mild weather forecasts more than offset rising LNG demand to dash hopes for a natural gas futures recovery as of midday Wednesday. The prompt month had shed 21.2 cents on Tuesday.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Caturus Builds LNG-Linked Gas Portfolio with South Texas Acquisition",
      "link": "https://naturalgasintel.com/news/caturus-builds-lng-linked-gas-portfolio-with-south-texas-acquisition/",
      "summary": "Caturus Energy LLC has moved to expand its South Texas natural gas holdings, pushing closer to its goal of becoming one of the largest U.S. independent natural gas producers and a Gulf Coast LNG player by the end of the decade.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Expand Energy Looking ‘Beyond the Wellbore,’ Chasing Natural Gas Demand After Leadership Shakeup",
      "link": "https://naturalgasintel.com/news/expand-energy-looking-beyond-the-wellbore-chasing-natural-gas-demand-after-leadership-shakeup/",
      "summary": "Expand Energy Corp., the nation’s largest natural gas producer, needs to better diversify downstream markets for its production, which is part of the reason the company chose to relocate to Houston, interim CEO Mike Wichterich said Wednesday.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "EQT Chief Calls for Reforms After Blowout Natural Gas Spot Prices During Winter Storm Fern",
      "link": "https://naturalgasintel.com/news/eqt-chief-calls-for-reforms-after-blowout-natural-gas-spot-prices-during-winter-storm-fern/",
      "summary": "EQT Corp. CEO Toby Rice said Wednesday that Winter Storm Fern was a “stark reminder” of how important natural gas infrastructure is to the country’s energy system and called on policymakers to ensure additional pipelines can be built.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "U.S. to Redirect Venezuelan Oil Royalties Into a Treasury-Controlled Fund",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/US-to-Redirect-Venezuelan-Oil-Royalties-Into-a-Treasury-Controlled-Fund.html",
      "summary": "Energy companies that want to produce crude oil in Venezuela will be paying local taxes and fees to the Venezuelan government, but royalty payments and federal taxes will go into a fund managed by the United States, the Treasury Department has said. ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "After Years of Buybacks, Big Oil is Drilling Again",
      "link": "https://oilprice.com/Energy/Crude-Oil/After-Years-of-Buybacks-Big-Oil-is-Drilling-Again.html",
      "summary": "After years of prioritizing returning cash to shareholders, oil supermajors are about to do something few expected: turning to growth as a top priority. The reason: contrary to dominant expectations, oil and gas will continue to be needed for decades",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Guyana Emerges as the Clear Winner in Venezuela’s Oil Reset",
      "link": "https://oilprice.com/Energy/Crude-Oil/Guyana-Emerges-as-the-Clear-Winner-in-Venezuelas-Oil-Reset.html",
      "summary": "One of the biggest winners from the new oil order in Venezuela is its neighbor to the east, Guyana, the country that turned into the newest oil producer in the world thanks to ExxonMobil’s massive oil discoveries.  Since Exxon first found oil in Guya",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Pentagon’s Nuclear Microreactor Demo Signals New Era for Deployable Power",
      "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Pentagons-Nuclear-Microreactor-Demo-Signals-New-Era-for-Deployable-Power.html",
      "summary": "The U.S. Departments of Energy (DOE) and Defense (DoD) have transported a small nuclear reactor from California to Utah on a cargo plane in a bid to demonstrate the potential to rapidly deploy small and micronuclear reactors (SMRs) for both military ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Space-Based Solar Power Will Be Economically Viable by 2040",
      "link": "https://oilprice.com/Alternative-Energy/Solar-Energy/Space-Based-Solar-Power-Will-Be-Economically-Viable-by-2040.html",
      "summary": "The renewable energy revolution is running out of land. Building out utility-scale solar and wind farms requires massive tracts of land that are often in competition with other needs – like agricultural operations – and which frequently face major le",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "U.S. Crude Oil Inventories Plunge Following Massive Build",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Crude-Oil-Inventories-Plunge-Following-Massive-Build.html",
      "summary": "The American Petroleum Institute (API) estimated that crude oil inventories in the United States fell by 609,000 barrels in the week ending February 13, after increasing by 13.4 million barrels in the week prior. Inventories in the US Strategic Petro",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Is It Time to Take Space-Based Solar Power Seriously?",
      "link": "https://oilprice.com/Alternative-Energy/Solar-Energy/Is-It-Time-to-Take-Space-Based-Solar-Power-Seriously.html",
      "summary": "Some of you may remember devouring those paperbacks with lurid, futuristic covers, imagining the worlds conjured up by Isaac Asimov, Arthur C. Clarke, Robert Heinlein, and Ray Bradbury: the planetary entrepreneurs, the galactic empires, and the firem",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}