{
  "last_updated": "2026-01-16 09:35",
  "items": [
    {
      "title": "Spot Prices Wrap: Natural Gas Retreats Despite Frigid Northern Air",
      "link": "https://naturalgasintel.com/news/spot-prices-wrap-natural-gas-retreats-despite-frigid-northern-air/",
      "summary": "Physical gas prices pulled back on Thursday as buyers took a breather amid fresh signs of robust supply.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Futures Settle: Anemic Storage Withdrawal Sends February Natural Gas Adrift",
      "link": "https://naturalgasintel.com/news/futures-settle-anemic-storage-withdrawal-sends-february-natural-gas-adrift/",
      "summary": "Natural gas futures treaded lightly in choppy trade on Thursday following a bearish government inventory result that left supply at healthy levels for coming waves of cold.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Mexico Pipeline Gas Imports Jump as U.S. Prices Stumble",
      "link": "https://naturalgasintel.com/news/mexico-pipeline-gas-imports-jump-as-us-prices-stumble/",
      "summary": "Mexican imports of U.S. pipeline natural gas rebounded sharply from holiday lows, climbing toward the 7 Bcf/d mark as U.S. futures struggled to maintain momentum.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Canada Leverages Low AECO Prices, Global Diplomacy to Advance LNG Exports",
      "link": "https://naturalgasintel.com/news/canada-leverages-low-aeco-prices-global-diplomacy-to-advance-lng-exports/",
      "summary": "Canadian officials are ramping up trade talks and cooperation agreements with key global natural gas buyers as it looks to accelerate development of more than 64 million tons/year (Mt/y) in LNG export capacity.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Natural Gas Forward Prices Retreat as East, West Hubs Lead Losses",
      "link": "https://naturalgasintel.com/news/natural-gas-forward-prices-retreat-as-east-west-hubs-lead-losses/",
      "summary": "Natural gas forward prices fell broadly during the Jan. 8–14 trading period as colder weather on tap for the second half of January appeared too little, too late to reverse rising estimates for end-of-season inventories.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Cheniere Commissioning Fifth Train at Corpus Christi LNG, Keeping Startup on Track for Spring",
      "link": "https://naturalgasintel.com/news/cheniere-commissioning-fifth-train-at-corpus-christi-lng-keeping-startup-on-track-for-spring/",
      "summary": "Cheniere Energy Inc. told state and federal regulators that it would begin starting up the fifth train at its Corpus Christi LNG Stage 3 expansion project in South Texas this week.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Midmorning Markets: Bearish EIA Storage Data Pushes February Natural Gas Lower",
      "link": "https://naturalgasintel.com/news/midmorning-markets-bearish-eia-storage-data-pushes-february-natural-gas-lower/",
      "summary": "A smaller-than-expected storage withdrawal reported by the U.S. Energy Information Administration (EIA) for the week ended Jan. 9 sent February natural gas futures lower in late morning trading.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "U.S. Exports to Europe Surge as Continent’s Pipeline Imports Fall, Asian Prices Still Weak",
      "link": "https://naturalgasintel.com/news/us-exports-to-europe-surge-as-continents-pipeline-imports-fall-asian-prices-still-weak/",
      "summary": "Europe’s pipeline imports continued to fall last year as increasing amounts of U.S. LNG entered the continent to displace Russian supplies in a trend that’s expected to continue.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "When Oil Falls but Exxon and Chevron Don’t",
      "link": "https://oilprice.com/Energy/Energy-General/When-Oil-Falls-but-Exxon-and-Chevron-Dont.html",
      "summary": "Despite a 20% slump in oil prices in 2025, the world’s biggest international oil firms saw their stocks rise by 4% to 18%, breaking the correlation between crude prices and oil stocks. Last year, investors appreciated the returns that were kept despi",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Russia’s Oil Revenue Slump Hits Budget Where It Hurts",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/Russias-Oil-Revenue-Slump-Hits-Budget-Where-It-Hurts.html",
      "summary": "Russia’s oil-and-gas budget suffered a painful blow in 2025. Revenues from the sector fell 24% to 8.48 trillion roubles, the weakest showing since 2020. That matters because oil and gas still bankroll roughly a quarter of the federal budget, and that",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Britain Bets Big on Offshore Wind to Hit 2030 Clean Power Goal",
      "link": "https://oilprice.com/Alternative-Energy/Wind-Power/Britain-Bets-Big-on-Offshore-Wind-to-Hit-2030-Clean-Power-Goal.html",
      "summary": "Ed Miliband has reaffirmed the UK’s ambitious 2030 clean power goal with the biggest ever expansion of offshore wind farms that could add as much as £1.8bn a year onto households’ energy bills. The government unveiled an auction of offshore energy si",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "China Leads Global Coal Power Additions Despite Renewables Push",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/China-Leads-Global-Coal-Power-Additions-Despite-Renewables-Push.html",
      "summary": "China continues to nearly single-handedly prop up global coal consumption and new coal-fired power generation, despite being also the world’s leading investor in renewables and battery storage.  China is set to commission as many as 85 coal-fired pow",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Prices Sink 4% As Geopolitical Fears Fizzle",
      "link": "https://oilprice.com/Energy/Crude-Oil/Oil-Prices-Sink-4-As-Geopolitical-Fears-Fizzle.html",
      "summary": "With traders across the globe refreshing their X accounts every 3 seconds, expecting to see news of imminent \"kinetic action\" in Iran, they instead got a report from NBC indicating that military action is far from certain and could take days to launc",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}