{
  "last_updated": "2026-02-14 09:11",
  "items": [
    {
      "title": "Spot Prices Wrap: Holiday Lull, Warmer Forecasts Sink Physical Natural Gas Prices",
      "link": "https://naturalgasintel.com/news/spot-prices-wrap-holiday-lull-warmer-forecasts-sink-physical-natural-gas-prices/",
      "summary": "Spot natural gas prices slipped nationwide Friday ahead of the Presidents’ Day holiday weekend, with traders booking Saturday–Tuesday supply.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Futures Settle: Bulls Retreat as Natural Gas Storage Miss, Spring Warming Undercuts Momentum",
      "link": "https://naturalgasintel.com/news/bulls-retreat-as-natural-gas-storage-miss-spring-warming-undercuts-momentum/",
      "summary": "Natural gas futures drifted on either-side of unchanged in the week’s final session after a smaller-than-expected storage draw out Thursday bolstered confidence in ample end-of-season supplies amid warming forecasts.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Snapshot: Physical Natural Gas Prices Slump as Eastern Demand Diminishes",
      "link": "https://naturalgasintel.com/news/midday-snapshot-physical-natural-gas-prices-slump-as-eastern-demand-diminishes/",
      "summary": "Natural gas cash prices petered out on Friday as energy buyers looked toward a long holiday weekend and mild weather in the trading week ahead.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Aramco Signs 20-Year LNG Deal With Caturus, Advancing Commonwealth Toward FID",
      "link": "https://naturalgasintel.com/news/aramco-signs-20-year-lng-deal-with-caturus-advancing-commonwealth-toward-fid/",
      "summary": "Caturus Energy LLC has solidified a long-term LNG supply deal with Saudi Arabian Oil Co. (Aramco), pushing its Louisiana export project closer to a final investment decision (FID) in the coming months, according to the company.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "MidDay Futures: Natural Gas Prices Fluctuate Amid Mixed Demand Signals",
      "link": "https://naturalgasintel.com/news/midday-futures-natural-gas-prices-fluctuate-amid-mixed-demand-signals/",
      "summary": "Natural gas futures traded on either side of even heading into midday on Friday, held in check by rapidly waning weather demand but supported by steady LNG activity.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "New England Receives Another LNG Import Cargo as Winter Takes its Toll",
      "link": "https://naturalgasintel.com/news/new-england-receives-another-lng-import-cargo-as-winter-takes-its-toll/",
      "summary": "The Excelerate Shenandoah delivered another full cargo this week from the Atlantic LNG terminal in Trinidad and Tobago to the Everett import facility in Boston Harbor as winter weather has stoked demand and kept prices elevated in the Northeast.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Northeast Prices Tumble, Rockies Firm in Mixed Natural Gas Forward Market",
      "link": "https://naturalgasintel.com/news/northeast-prices-tumble-rockies-firm-in-mixed-natural-gas-forward-market/",
      "summary": "U.S. natural gas forward prices dipped again over the past week as markets continued to recover from January’s bitter cold, but modest strengthening in basis prices indicate traders haven’t ruled out risks of regional volatility.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Can Venezuela’s New Hydrocarbons Law Revive Its Oil Industry?",
      "link": "https://oilprice.com/Energy/Energy-General/Can-Venezuelas-New-Hydrocarbons-Law-Revive-Its-Oil-Industry.html",
      "summary": "Politics, Geopolitics & Conflict It’s time for DC to evaluate whether Venezuela’s new hydrocarbons law can produce actual supply gains, and with that in mind, the U.S. energy secretary traveled to Caracas this week, touring Chevron-PDVSA joint operat",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Oil Prices Slide as Supply Swells and Demand Fears Deepen",
      "link": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Slide-as-Supply-Swells-and-Demand-Fears-Deepen.html",
      "summary": "West Texas Intermediate (WTI) crude oil futures are trading sharply lower this week, with nearby contracts at $62.87 as of Thursday night, down $0.68 or -1.07% for the session. The weekly range spans from a high of $65.83 to a low of $62.39, reflecti",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "British Gas Boss Warns UK Electricity Bills Will Soar by 2030",
      "link": "https://oilprice.com/Energy/Energy-General/British-Gas-Boss-Warns-UK-Electricity-Bills-Will-Soar-by-2030.html",
      "summary": "Electricity bills will be higher in 2030 than in the wake of the Russian invasion of Ukraine, the boss of British Gas has warned, as the government pushes through major upgrades to the UK’s grid infrastructure. Chris O’Shea, chief executive of Britis",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "U.S. Rig Count Holds Steady as Oil Drilling Slips and Gas Activity Climbs",
      "link": "https://oilprice.com/Energy/Energy-General/US-Rig-Count-Holds-Steady-as-Oil-Drilling-Slips-and-Gas-Activity-Climbs.html",
      "summary": "The total number of active drilling rigs for oil and gas in the United States stayed the same this week, according to new data that Baker Hughes published on Friday, keeping the total rig count in the US  at 551 this week, down 37 from this same time",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "TC Energy Tops Q4 Profit Estimate on Strong U.S. Natural Gas Demand",
      "link": "https://oilprice.com/Latest-Energy-News/World-News/TC-Energy-Tops-Q4-Profit-Estimate-on-Strong-US-Natural-Gas-Demand.html",
      "summary": "TC Energy Corporation beat analyst estimates for fourth-quarter profits amid soaring demand for natural gas in the United States which boosted its pipeline flows to an all-time delivery record early this year. TC Energy on Friday reported earnings pe",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "Supply Fears Return as OPEC+ Eyes Output Expansion",
      "link": "https://oilprice.com/Energy/Energy-General/Supply-Fears-Return-as-OPEC-Eyes-Output-Expansion.html",
      "summary": "Oil prices are once again under pressure after several OPEC+ members signaled a willingness to start hiking production again, even as inflation data provided some support. Friday, February 13, 2026OPEC+ never fails to disappoint oil bulls, this time ",
      "source": "OilPrice.com",
      "published": "Recent"
    },
    {
      "title": "OPEC+ Considers April Output Hike After Its Winter Pause",
      "link": "https://oilprice.com/Energy/Energy-General/OPEC-Considers-April-Output-Hike-After-Its-Winter-Pause.html",
      "summary": "Ahead of the monthly meeting on March 1, the OPEC+ alliance is leaning toward resuming production increases from April following a pause in the first quarter, Reuters reported on Friday, quoting sources within the group. Early this month, the eight O",
      "source": "OilPrice.com",
      "published": "Recent"
    }
  ]
}