{
  "last_updated": "2025-12-12 09:11",
  "items": [
    {
      "title": "Big Storage Withdrawal Fails to Halt Natural Gas Futures Selloff",
      "link": "https://naturalgasintel.com/news/big-storage-withdrawal-fails-to-halt-natural-gas-futures-selloff/",
      "summary": "A larger-than-expected storage withdrawal was not enough to shake natural gas futures from their bearish trend, with traders staying focused on milder mid-range forecasts and weakening demand expectations.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Weak Forecasts Outweigh Inventory Decline as Natural Gas Futures Plummet, Waha Hits Negative $6",
      "link": "https://naturalgasintel.com/news/weak-forecasts-outweigh-inventory-decline-as-natural-gas-futures-plummet-waha-hits-negative-6/",
      "summary": "A bullish storage surprise from the U.S. Energy Information Administration (EIA) proved insufficient to stem heavy losses for natural gas futures as unsupportive weather outlook drove selling.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Mexican Natural Gas Imports Trend Toward Record as Prices Slide",
      "link": "https://naturalgasintel.com/news/mexican-natural-gas-imports-trend-toward-record-as-prices-slide/",
      "summary": "U.S.-Mexico natural gas pipeline trade showed no sign of slowing in early December, with cross-border flows rebounding from a dip in early November.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Nationwide Natural Gas Prices Spike, but Pipeline Bottleneck Helps Send Permian to Negative $4",
      "link": "https://naturalgasintel.com/news/nationwide-natural-gas-prices-spike-but-pipeline-bottleneck-helps-send-permian-to-negative-4/",
      "summary": "Most of the Lower 48 is seeing natural gas spot prices above $4.00/MMBtu and Northeast prices are upward of $20.00, so why are Permian Basin prices back in the negatives?",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Weather Shift Weighs on Natural Gas Futures After Bullish Storage Draw",
      "link": "https://naturalgasintel.com/news/weather-shift-weighs-on-natural-gas-futures-after-bullish-storage-draw/",
      "summary": "The U.S. Energy Information Administration (EIA) on Thursday reported a 177 Bcf withdrawal from natural gas storage for the week ended Dec. 5. Despite the massive pull, natural gas futures extended losses as traders focused on shifting mid-December w",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Lake Charles LNG Moves Toward ‘26 Green Light; Early Site Prep Targeted",
      "link": "https://naturalgasintel.com/news/lake-charles-lng-moves-toward-26-green-light-early-site-prep-targeted/",
      "summary": "Energy Transfer LP (ET) is looking to make a final investment decision (FID) and start early site preparations for its Lake Charles LNG export project early next year, according to management and regulatory filings.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Trinity Gas Storage Launches 13 Bcf Expansion as Power, LNG Loads Accelerate",
      "link": "https://naturalgasintel.com/news/trinity-gas-storage-launches-13-bcf-expansion-as-power-lng-loads-accelerate/",
      "summary": "Trinity Gas Storage LLC has reached a final investment decision (FID) on a second phase of its East Texas natural gas storage facility, expanding capacity as Texas contends with growing demand volatility from data centers, LNG exports and extreme wea",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Natural Gas Futures Resume Plunge as Forecasts Unsupportive",
      "link": "https://naturalgasintel.com/news/natural-gas-futures-resume-plunge-as-forecasts-unsupportive/",
      "summary": "A midweek respite proved short-lived for battered natural gas futures, which moved lower in early Thursday trading as the market looked beyond near-term cold to a much milder setup for next week through Christmas.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "Volatility Seen Resuming After ‘Break in Action’ as Natural Gas Futures Edge Higher",
      "link": "https://naturalgasintel.com/news/volatility-seen-resuming-after-break-in-action-as-natural-gas-futures-edge-higher/",
      "summary": "Traders pushed natural gas prices higher on Wednesday in anticipation of a substantial storage draw and stronger demand tightening near-term balances.",
      "source": "Natural Gas Intel",
      "published": "Recent"
    },
    {
      "title": "European Commission approves German LNG terminal joint venture",
      "link": "https://www.lngworldnews.com/european-commission-approves-german-lng-terminal-joint-venture/",
      "summary": "The joint venture between Gasunie, Oiltanking, and Vopak has received approval from the European Commission to establish an LNG joint venture aimed at constructing an LNG terminal in Germany.\nThe post European Commission approves German LNG terminal ",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Wheatstone LNG’s second train 90 pct done",
      "link": "https://www.lngworldnews.com/wheatstone-lngs-second-train-90-pct-done/",
      "summary": "Construction of the second liquefaction train at the Chevron-led Wheatstone LNG project in Western Australia has surpassed 90 percent completion\nThe post Wheatstone LNG’s second train 90 pct done appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Volvo Trucks North America to Launch LNG Engine",
      "link": "https://www.lngworldnews.com/volvo-trucks-north-america-to-launch-lng-engine/",
      "summary": "Volvo Trucks North America is set to introduce its own 13-liter liquefied natural gas (LNG) engine for the North American market in 2014\nThe post Volvo Trucks North America to Launch LNG Engine appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Video: Saipem’s work on Ichthys LNG pipeline",
      "link": "https://www.lngworldnews.com/video-saipems-work-on-ichthys-lng-pipeline/",
      "summary": "Italian oil and gas contractor Saipem was tasked with executing the construction of the 890 km gas export offshore pipeline for the Ichthys LNG project, led by Inpex, in Australia back in 2012.\nThe post Video: Saipem’s work on Ichthys LNG pipeline ap",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Shells prelude flng to start production in 2017",
      "link": "https://www.lngworldnews.com/shells-prelude-flng-to-start-production-in-2017/",
      "summary": "Shell's monumental Prelude FLNG facility is poised to commence chilled gas production offshore Western Australia in 2017\nThe post Shells prelude flng to start production in 2017 appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    },
    {
      "title": "Nobles Colorado LNG facility moving forward",
      "link": "https://www.lngworldnews.com/nobles-colorado-lng-facility-moving-forward/",
      "summary": "Noble Energy, headquartered in Houston, has confirmed that construction progress on its Keota LNG facility in Colorado is proceeding as planned.\nThe post Nobles Colorado LNG facility moving forward appeared first on Lngworldnews.",
      "source": "LNG World News",
      "published": "Recent"
    }
  ]
}